{"1995": [{"title": "S v Zuma and Others (CCT5/94) [1995] ZACC 1; 1995 (2) SA 642; 1995 (4) BCLR 401 (SA); 1995 (1) SACR 568; [1996] 2 CHRLD 244 (5 April 1995)", "url": "http://www.saflii.org/za/cases/ZACC/1995/1.html", "summary_document": {"filename": "1media.pdf", "file_url": "http://www.saflii.org/za/cases/ZACC/1995/1media.pdf", "file_content": "S v Zuma and others\nCase CCT 5/94\nExplanatory Note\n\nThe following explanation is provided to assist the media in reporting this case and is not\nbinding on the Constitutional Court or any member of the Court.\nSection 217(1)(b)(ii) of the Criminal Procedure Act 51 of 1977 provides that where a\nconfession by an accused person has been made to a magistrate or has been confirmed and\nreduced to writing in the presence of a magistrate it shall be admissible in evidence against\nthe accused. The subparagraph further provides that the confession shall be presumed, unless\nthe contrary is proved, to have been freely and voluntarily made by the accused in his or her\nsound and sober senses and without having been unduly influenced to make the confession.\nThe accused were indicted on two counts of murder and one of robbery. At their trial before\nHugo J in the Natal Provincial Division they pleaded not guilty. Two of the accused had\nmade statements before a magistrate which were tendered by the prosecution as admissible\nconfessions. The question arose whether s 217(1)(b)(ii) of the Criminal Procedure Act was\ninconsistent with the provisions of the Constitution. Counsel for the defence and the\nprosecution consented in terms of s 101(6) of the Constitution to the trial judge deciding the\nissue. Notwithstanding the consent, Hugo J refrained from deciding on the validity of the\nsection, referring the matter to the Constitutional Court for decision and adjourning the trial\nsine die. The Attorney-General of Natal sought direct access to the Constitutional Court in\nterms of s 100(2) of the Constitution on the grounds that it was in the interests of justice that\na binding decision be given as soon as possible on the validity of s 217(1)(b)(ii).\nThe Court granted the application for direct access.\nThe Court found s 217(1)(b)(ii) to be in violation of s 25(3) of the Constitution (right to a fair\ntrial). It held it to be a longstanding principle of English and South African law of evidence\nthat the prosecution should prove that any confession on which it wished to rely was freely\nand voluntarily made. Section 217(1)(b)(ii) of the Criminal Procedure Act places on the\naccused the burden of proving on a balance of probabilities that a confession recorded by a\nmagistrate was not free and voluntary. It is not sufficient for the accused merely to raise a\ndoubt. The section therefore creates a legal burden of rebuttal on the accused -- a so-called\n'reverse onus'.\nThe Court considered the common law rule requiring the prosecution to prove that a\nconfession has been freely and voluntarily made to be inherent in the rights specifically\nmentioned in s 25(2), s 25(3)(c) and (d) of the Constitution and forms part of the right to a\nfair trial. These rights are the necessary reinforcement of the principle that the prosecution\nmust prove the guilt of the accused beyond reasonable doubt. Reversing the burden of proof\nseriously compromises and undermines these rights. It followed that s 217(1)(b)(ii) violates\nthese provisions.\n\n1\n\n\fThe Court held that the tests of reasonableness, justification and necessity for limitation of\nfundamental rights set out in s 33(1) of the Constitution are not identical, and in applying\neach of them individually one will not always get the same result. But in the present case, it\nwas held, reasonableness, justification and necessity may be looked at and assessed together.\nThe rights interfered with are fundamental to concepts of justice and forensic fairness and\nhave existed in South Africa for over 150 years. A drastic consequence of the alteration to the\nlaw brought about by s 217(1)(b)(ii) is the possibility that an accused may be convicted over\nthe reasonable doubt of the court. It was not shown by the state that it was impossible or\nunduly burdensome for the prosecution to discharge its onus under the common law rule. Nor\nwas it shown that the common law rule caused substantial harm to the administration of\njustice. Even if it were assumed that the reverse onus may in some cases obviate or shorten a\ntrial within a trial on the admissibility of a confession, and released the prosecution from the\ninconvenience of marshalling and calling their witnesses before the accused gave evidence,\nthese advantages do not outweigh and justify the substantial infringement of fundamental\nrights that are the result of the application of the subparagraph. Accordingly s 217(1)(b)(ii)\ndoes not meet the criteria laid down in s 33(1) of the Constitution. It is declared inconsistent\nwith the Constitution and invalid.\nIn the absence of a specific order by the Constitutional Court in the interests of justice and\ngood government giving retrospective effect to a declaration that a law is invalid, s 98(6)(a)\nprovides that a declaration of invalidity shall not invalidate anything done or permitted in\nterms of that law before the coming into effect of the declaration of invalidity. The Court held\nthat the likely result of ordering the declaration of invalidity of s 217(1)(b)(ii) to have full\nretrospective effect, invalidating earlier rulings on admissibility, would be numerous appeals\nwith the possibility of proceedings de novo. In proceedings de novo the necessary evidence\nof voluntariness may no longer be available. The Court considered s 98(6)(a) to be intended\nto ensure that the invalidation of a law existing at the commencement of the Constitution\nshould not ordinarily have retrospective effect, so as to avoid the dislocation and\ninconvenience of undoing transactions, decisions or actions taken under that law. The\nConstitutional Court's power to order otherwise in the interests of justice and good\ngovernment should be exercised circumspectly. In some cases the interests of individuals\nmust be weighed against the interest of avoiding dislocation to the administration of justice\nand the desirability of a smooth transition from the old to the new. The application of the\nsubparagraph may well have caused injustice to accused persons, but the court cannot repair\nall past injustice by a simple stroke of the pen. In the present case, it was held, a proper\nbalance could be struck by invalidating the admission of any confession in reliance on s\n217(1)(b)(ii) of the Criminal Procedure Act before the date of the declaration of invalidity of\nthe section, but in respect only of trials begun on or after 27 April 1994 and in which the\nverdict had not been given at the date of the declaration.\nThe judgment of the Court was delivered by Kentridge AJ and was concurred in by all the\nother members of the Court.\n\n2\n\n\f"}, "judgement_document": {"filename": "1.pdf", "file_url": "http://www.saflii.org/za/cases/ZACC/1995/1.pdf", "file_content": "IN THE CONSTITUTIONAL COURT OF SOUTH AFRICA\n\nIn the matter of :\n\nCASE NO : CCT/5/94\n\nZUMA AND TWO OTHERS\n\nApplicants\n\nand\n\nTHE STATE\n\nRespondent\n\nHEARD ON\n\n23 February 1995\n\nDELIVERED ON\n\n5 April 1995\n\nJUDGMENT\n\n[1]\n\nKENTRIDGE AJ:\n\nThis case arises from a criminal trial\n\nbefore Hugo J in the Natal Provincial Division.\n\nIn this\n\n\f2\nCourt it was heard together with the case of Mhlungu and\nFour Others v The State (Case No CCT/25/94) which also arose from\na criminal trial in the Natal Provincial Division.\n\nEach of them\n\nhas come to this Court by way of a referral by the judge\npresiding over the trial.\nthis\n\nCourt\n\nfor\n\nIn each case the judge referred to\n\ndecision\n\nthe\n\nquestion\n\nwhether\n\nsection\n\n217(1)(b)(ii) of the Criminal Procedure Act No 51 of 1977 is\ninconsistent with the provisions of the Republic of South Africa\nConstitution, 1993.\n\nIf we so find it will be our duty under\n\nsection 98(5) of the Constitution to declare the provision\ninvalid.\n\nIn the Mhlungu case the judge also referred to us the\n\nquestion\n\nwhether,\n\nhaving\n\nregard\n\nto\n\nsection\n\n241(8)\n\nof\n\nthe\n\nConstitution, the provisions of Chapter 3 of the Constitution\napply to the proceedings before him.\n\nSection 241(8) raises\n\nimportant issues which do not directly touch the Zuma case.\nConsequently, we propose to give judgment at this stage only in\nthe Zuma case, and to deal with the Mhlungu case in due course\nin a separate judgment.\n\n[2]\n\nIn this case (as in the Mhlungu case) this Court itself has\nraised the issue whether the referral was competent. It is\nnecessary to set out in some detail the circumstances of\nthe criminal trial which led to the referral to this Court.\nBefore doing so, however, I must outline the history and\neffect of the challenged sub-paragraph of section 217 of\n\n\f3\nthe Criminal Procedure Act.\n\n[3]\n\nThe section deals with the admissibility in evidence of a\nconfession made by an accused person before trial.\n\nSub-\n\nsection (1) and proviso (a) thereto read as follows Evidence of any confession made by any person in relation to the\ncommission of any offence shall, if such confession is proved to\nhave been freely and voluntarily made by such person in his sound\nand sober senses and without having been unduly influenced\nthereto, be admissible in evidence against such person at\ncriminal proceedings relating to such offence :\nProvided -\n\n\"(1)\n\n(a)\n\nIt\n\nwill\n\nthat a confession made to a peace officer, other than a\nmagistrate or justice, or, in the case of a peace officer\nreferred to in section 334, a confession made to such peace\nofficer which relates to an offence with reference to which\nsuch peace officer is authorized to exercise any power\nconferred upon him under that section, shall not be\nadmissible in evidence unless confirmed and reduced to\nwriting in the presence of a magistrate or justice;...\"\n\nbe\n\nprosecution,\n\nseen\nif\n\nthat\nit\n\nthis\n\nwishes\n\nsub-section\nto\n\nput\n\nrequires\n\nthe\n\nconfession\n\nthe\nin\n\nevidence, to prove that it was freely and voluntarily made,\nand was not unduly influenced.\n\nThis means, at the least,\n\nproof that it was not induced by violence, or by threats or\npromises made by a person in authority.\n\nR v Barlin 1926 AD\n\n459, 462; R v Nhleko 1960(4) SA 712(A);\nothers (2) 1983(1) SA 576(C).\n\nS v Mpetha and\n\nThis rule, which reflects a\n\nlong-standing principle of the English law of criminal\nprocedure\n\nand\n\nevidence,\n\nwas\n\nembodied\n\nOrdinance of the Cape Colony in 1830.\n\nin\n\nthe\n\nEvidence\n\nThe rationale of the\n\nrule excluding involuntary confessions (or admissions) has\nbeen\n\nmuch\n\ndiscussed.\n\nSee\n\nHoffmann\n\nand\n\nZeffertt,\n\nSouth\n\n\f4\nAfrican Law of Evidence, 4th ed. pp 205, 216-7 ;\nEvidence, 6th ed pp 601-3.\n\nCross on\n\nI shall return in due course to\n\nthe historical development of the rule.\n\nAt this stage it\n\nis sufficient to say that before the Union of the four\nprovinces in 1910 it was well established in all parts of\nSouth Africa that it was for the prosecution to prove that\nany confession on which it wished to rely was freely and\nvoluntarily made.\n\n[4]\n\nProviso (a), on the other hand, has no counterpart in\nEnglish law.\n\nIt was introduced into South African law by\n\nthe Criminal Procedure and Evidence Act, 1917.\n\nIts general\n\neffect is that confessions made to members of the police\nforce who are not justices of the peace are inadmissible.\nAn accused person who has confessed, or expressed a wish to\nconfess, to a police officer who is not a justice of the\npeace should be taken to a magistrate or justice of the\npeace who may take down the confession in writing.\n\nEven\n\nwhere the police officer is a justice of the peace the\naccused person may be taken to a magistrate who may take\ndown the confession in writing.\n\nThe magistrate ought, of\n\ncourse, to be satisfied that the confession is freely and\nvoluntarily\n\nmade,\n\nand\n\nshould\n\nrecord\n\ndocument containing the confession.\n\nthat\n\nfact\n\nin\n\nthe\n\nIt is at that stage\n\nthat proviso (b) to section 217(1) becomes relevant.\n\nThat\n\n\f5\nproviso reads \"Provided...\n\"(b)\n\nthat where the confession is made to a magistrate and reduced to\nwriting by him, or is confirmed and reduced to writing in the\npresence of a magistrate, the confession shall, upon the mere\nproduction thereof at the proceedings in question(i)\n\nbe admissible in evidence against such person if it appears\nfrom the document in which the confession is contained that\nthe confession was made by a person whose name corresponds\nto that of such person and, in the case of a confession\nmade to a magistrate or confirmed in the presence of a\nmagistrate through an interpreter, if a certificate by the\ninterpreter appears on such document to the effect that he\ninterpreted truly and correctly and to the best of his\nability with regard to the contents of the confession and\nany question put to such person by the magistrate; and\n\n(ii)\n\nbe presumed, unless the contrary is proved, to have been\nfreely and voluntarily made by such person in his sound and\nsober senses and without having been unduly influenced\nthereto, if it appears from the document in which the\nconfession is contained that the confession was made freely\nand voluntarily by such person in his sound and sober\nsenses and without having been unduly influenced thereto.\n\nIt is sub-paragraph (ii) of this proviso that is under\nattack in the present case.\n\nIt was introduced into the\n\ncriminal procedure code in 1977.\n\nIn the circumstances set\n\nout in the sub-paragraph it places on the accused the\nburden of proving that the confession recorded by the\nmagistrate was not free and voluntary.\n\nThe words \"unless\n\nthe contrary is proved\" place an onus on the accused which\nmust be discharged on a balance of probabilities. He does\nnot discharge the onus merely by raising a doubt.\n\nIf, at\n\nthe end of the voir dire (or trial-within-a-trial) the\nprobabilities are evenly balanced the presumption prevails.\nSee Ex parte Minister of Justice:\n345, 360-1;\n\nin re R v Bolon 1941 AD\n\nS v Nene and Others (2) 1979(2) SA 521(D);\n\nS\n\n\f6\nv Mkanzi and Another 1979(2) SA 757(T);\n\nS v Mphahlele and\n\nAnother 1982(4) SA 505(A) 512.\n\n[5]\n\nI add, by way of completeness, that sub-section (2) of\nsection 217 provides that the prosecution may lead evidence\nin rebuttal of evidence advanced by an accused in rebuttal\nof the presumption under proviso (b).\n\n[6]\n\nIn the case before us the prosecution tendered confessions\nwhich\n\nhad\n\nbeen\n\nmagistrate\n\nand\n\nmade\n\nby\n\ntwo\n\nreduced\n\nto\n\nof\n\nthe\n\nwriting,\n\naccused\nand\n\nbefore\n\ninvoked\n\na\n\nthe\n\npresumption in proviso (b).\n\n[7]\n\nThe accused were indicted on two counts of murder and one\nof robbery.\n\nAt their trial before Hugo J and assessors\n\nthey pleaded not guilty.\n\nTwo of the accused had made\n\nstatements before a magistrate which counsel for the state\ntendered\n\nas\n\nadmissible\n\nconfessions.\n\nAdmissibility\n\nwas\n\ncontested by counsel for the accused and a trial-within-atrial ensued.\n\nAt the outset\n\ndefence counsel raised the\n\nissue of the constitutionality of section 217(1)(b)(ii) of\nthe\n\nCriminal\n\nProcedure\n\nAct,\n\nand\n\ncounsel\n\nfor\n\nboth\n\nthe\n\ndefence and the prosecution consented (in terms of section\n101(6) of the Constitution) to the trial judge's deciding\nthat\n\nissue.\n\nThe\n\ntrial-within-a-trial\n\nnonetheless\n\n\f7\nproceeded.\n\nThe accused testified that they had made their\n\nstatements by reason of assaults on them by the police and\nthe threat of further assaults.\n\nThe policemen concerned\n\ndenied this, but two women called as witnesses by the\ndefence said that they had seen the police assaulting the\naccused.\n\nAt the end of the evidence the court concluded\n\nunanimously that while they were not satisfied beyond a\nreasonable doubt that the statements had been freely and\nvoluntarily made, the accused had failed to discharge the\nonus\n\nupon\n\nthem\n\nprobabilities.\n\nunder\n\nproviso\n\n(b)\n\non\n\na\n\nbalance\n\nof\n\nIn his judgment, given on 10th August, 1994\n\nand reported as S v Zuma and Others 1995(1) BCLR 49 (N),\nHugo J said \"Had we been convinced that section 217(1)(b) of the\nCriminal Procedure Act was still valid and constitutional\nwe would therefore have had little hesitation in accepting\nthat the accused had not discharged the onus placed upon\nthem by that section. The constitutionality therefore of\nsection 217(1)(b) of the Criminal Procedure Act is\ntherefore crucial to the decision of this case.\"\n\nLater in his judgment he said -\n\n\"It is quite clear from what I have said that the site of\nthe onus will be decisive in this case, at least in so far\nas the admissibility of this evidence is concerned. If it\nis held by the constitutional court that section\n217(1)(b)(ii) is unconstitutional it will lead to the most\nunfortunate result that two persons who have in effect\nadmitted under oath in this Court that they indeed\ncommitted these offences may be acquitted but that may well\nbe the effect of the constitution or the provisions of the\nconstitution upon matters of this nature. It is also the\neffect of the hearing of matters of this nature in a\nseparate trial-within-a-trial, the evidence of which is not\nadmissible in deciding the merits of the conviction.\"\n\n\f8\nThe reference to the admissions of the two accused that\nthey had committed the offences arose from the evidence\nwhich they had given in the course of the trial-within-atrial.\n\nAs Hugo J fully appreciated, that evidence was\n\ngiven only in the context of the trial-within-a-trial,\nwhere the only issue was admissibility.\n\nTo that issue the\n\ntruth of the confession was irrelevant.\n\nThus, in S v\n\nRadebe and Another, 1968(4) SA 410(A) 419 Ogilvie Thompson\nJ A said\"It not infrequently occurs that, although the presiding\nJudge may think that the contents of a tendered confession\nare true, the circumstances whereunder the confession was\nmade compel its exclusion\".\n\nSee also S v Gaba 1985(4) SA 734(A) 749;\n\nS v Talane\n\n1986(3) SA 196(A) 205; S v de Vries 1989(1) SA 228(A), 2334.\n\n[8]\n\nIn the event, notwithstanding the consent given by the\nparties under section 101(6) Hugo J refrained from giving\na decision on the validity of the proviso, but referred the\nquestion to this court, and adjourned the trial sine die.\n\n[9]\n\nThe question of the competence of Hugo J's referral arises,\nand has been argued before us by counsel for the accused\nand for the State.\n\nIn addition we have received a Notice\n\nof Motion under the hand of Mr. T P McNally SC, AttorneyGeneral for Natal, seeking direct access to the Court in\n\n\f9\nterms of section 100(2) of the Constitution on the grounds\nthat it is in the interests of justice that a binding\ndecision be given as soon as possible on the validity of\nsection 217(1)(b)(ii).\n\n[10] By reason of the consent of the parties under section\n101(6) the issue of the constitutionality\n217(1)(b)(ii)\n\nof\n\nthe\n\nCriminal\n\nProcedure\n\nof section\n\nAct\n\nno\n\nlonger\n\nremained within the exclusive jurisdiction of this Court,\nand fell within the jurisdiction of Hugo J.\n\nFor reasons\n\nwhich will be given in detail in the Mhlungu case the\nreferral by Hugo J was wholly incompetent.\n\nThat was indeed\n\nthe submission of the State in its written argument, and\nthe point was rightly conceded by counsel for the accused.\nEven if a rapid resort to this Court were convenient that\nwould not relieve the judge from making his own decision on\na\n\nconstitutional\n\nissue\n\nwithin\n\nhis\n\njurisdiction.\n\nThe\n\njurisdiction conferred on judges of the Provincial and\nLocal Divisions of the Supreme Court under section 101(3)\nis not an optional jurisdiction.\nconferred\n\nin\n\norder\n\nto\n\nbe\n\nThe jurisdiction was\n\nexercised.\n\nIt\n\nwas\n\nin\n\nthese\n\ncircumstances that the Attorney-General of Natal applied\nunder section 100(2) of the Constitution for direct access\nto the Court.\n\"(2)\n\nSection 100(2) reads -\n\nThe rules of the Constitutional Court may make\nprovision for direct access to the Court where it is\nin the interest of justice to do so in respect of any\n\n\f10\nmatter over which it has jurisdiction.\"\n\nRule 17, subrules (1) and (2) of the Rules of this Court\nprovide(1)\n\nThe Court shall allow direct access in terms of section\n100(2) of the Constitution in exceptional circumstances\nonly, which will ordinarily exist only where the matter is\nof such urgency, or otherwise of such public importance,\nthat the delay necessitated by the use of the ordinary\nprocedures would prejudice the public interest or prejudice\nthe ends of justice and good government.\n\n(2)\n\nThe special procedure referred to in subrule (1) may be\nsanctioned by the Court on application made to it in terms\nof these rules.\n\n[11] The Attorney-General of Natal submits in his supporting\naffidavit that if the matter is sent back to the trial\ncourt without our deciding the issue it would have to be\nreferred again to this Court at the end of the trial.\n\nMore\n\nimportant, he informs us that prevailing uncertainty as to\nthe constitutionality of section 217(1)(b)(ii) has resulted\nin inconsistency in practice in Natal and elsewhere in the\nRepublic.\n\nThat uncertainty would remain unresolved until\n\na suitable case came properly before this Court.\n\nWe agree\n\nwith the Attorney-General of Natal and with Mr d'Oliviera\nSC, the Attorney-General of the Transvaal, who appeared for\nthe\n\nState\n\nthat\n\nthis\n\nstate\n\nof\n\naffairs\n\nmust\n\nseriously\n\nprejudice the general administration of justice as well as\nthe interests of the numerous accused persons affected.\nThe admissibility of confessions is a question which arises\ndaily in our criminal courts and prolonged uncertainty\nwould be quite unacceptable.\n\nAs appears from the terms of\n\n\f11\nRule 17, direct access is contemplated in only the most\nexceptional cases, and it is certainly not intended to be\nused to legitimate an incompetent reference.\nspecial\n\ncircumstances\n\napplication\n\nunder\n\nrule\n\nset\n\nout\n\nin\n\nthe\n\n17\n\nwas\n\nfully\n\nBut in the\n\naffidavit\n\njustified.\n\nthe\nMr.\n\nMcNally's application is accordingly granted, so that the\nquestion\n\nof\n\nthe\n\nvalidity\n\nof\n\nsection\n\n217(1)(b)(ii)\n\nis\n\nproperly before this Court.\n\n[12] Counsel for the accused has attacked section 217(1)(b)(ii)\nas being in conflict with section 25 of the Constitution.\nThe\n\nparticular\n\nprovisions\n\nof\n\nsection\n\n25\n\nrelied\n\non\n\nindividually or cumulatively are the following \"25 (2)\n\nEvery person arrested for the alleged commission of\nan offence shall ... have the right (a)\nshe\n\npromptly to be informed, in a language which he or\nunderstands, that he or she has the right to\nremain silent and to be warned of the\nconsequences of making any statement;\n\n...\n(c)\n\nnot to be compelled to make a confession or admission\nwhich could be used in evidence against him or her ;\nand\n\n...\n(3)\n\nEvery accused person shall have the right to a fair trial,\nwhich shall include the right ...\n(c)\n\nto be presumed innocent and to remain silent during\nplea proceedings or trial and not to testify during\ntrial ;\n\n(d)\n\nto adduce and challenge evidence, and not to be a\ncompellable witness against himself or herself;\n\nThe concepts embodied in these provisions are by no means\n\n\f12\nan\n\nentirely\n\nprocedure.\n\nnew\n\ndeparture\n\nin\n\nSouth\n\nAfrican\n\ncriminal\n\nThe presumption of innocence, the right of\n\nsilence and the proscription of compelled confessions have\nfor 150 years or more been recognised as basic principles\nof our law, although all of them have to a greater or\nlesser degree been eroded by statute and in some cases by\njudicial decision.\n\nThe resulting body of common law and\n\nstatute law forms part of the background to section 25.\nThe provisions of section 25 are more specific than many of\nthe other provisions of Chapter 3.\n\nThey do nonetheless\n\ngive rise to problems of interpretation.\n\n[13] The\n\nprinciples\n\nupon\n\nwhich\n\na\n\nconstitutional\n\nbill\n\nof\n\nfundamental rights should be interpreted have been the\nsubject of numerous judicial dicta, in jurisdictions abroad\nand in Southern Africa.\n\nMany of these principles have been\n\nre-stated and applied in the judgments of Provincial and\nLocal Divisions interpreting our own Constitution, and in\njudgments of other Southern African courts.\n\nThe judgment\n\nof Friedman J in Nyamakazi v President of Bophututswana,\n1994(1)\n\nBCLR\n\n92(B)\n\ninternational authority.\n\nis\n\na\n\nveritable\n\nthesaurus\n\nof\n\nKhala v The Minister of Safety &\n\nSecurity 1994(2) BCLR 89(W), 92-4; 1994 (4) SA 218(W), 2224 per Myburgh J also contains a useful collection of\ncitations.\n\nIt\n\nis\n\nnot\n\nnecessary\n\nto\n\ntraverse\n\nall\n\nthe\n\n\f13\nrelevant dicta but some of them bear repeating.\n\n[14] The first of these is the much-quoted passage from the\njudgment\n\nof\n\nLord\n\nWilberforce\n\nin\n\nthe\n\nPrivy\n\nCouncil\n\nin\n\nMinister of Home Affairs (Bermuda) v Fisher [1980] AC 319\n(PC), 328-9.\n\nAfter referring to the influence of certain\n\ninternational conventions on the constitutions of former\ncolonies of the British Commonwealth, he said that these\ncalled for\n\"a generous interpretation ... suitable to give to\nindividuals the full measure of the fundamental rights and\nfreedoms referred to,\"\n\nand\n\nthat\n\nthe\n\nconstitution\n\ninterpretation of its own\".\n\ncalled\n\nfor\n\n\"principles\n\nof\n\nHe went on to say -\n\n\"This is in no way to say that there are no rules of law\nwhich should apply to the interpretation of a constitution.\nA constitution is a legal instrument giving rise, amongst\nother things, to individual rights capable of enforcement\nin a court of law. Respect must be paid to the language\nwhich has been used and to the traditions and the usages\nwhich have given meaning to that language.\nIt is quite\nconsistent with this, and with the recognition that rules\nof interpretation may apply, to take as a point of\ndeparture for the process of interpretation a recognition\nof the character and origin of the instrument, and to be\nguided by the principle of giving full recognition and\neffect to those fundamental rights and freedoms with a\nstatement of which the constitution commences.\"\n\nThis judgment was cited with approval by the Appellate\nDivision in S v Marwane 1982(3) SA 717(A), 748-9.\n\nSee also\n\nthe judgment of the Full Bench of the Supreme Court of\nNamibia\n\nin\n\nMinister\n\nof\n\nDefence,\n\n1992(2) SA 355 (Nm SC), 362.\n\nNamibia\n\nv\n\nMwandinghi\n\n\f14\n[15] In R v Big M Drug Mart Ltd (1985)18 DLR (4th) 321,395-6,\nDickson\n\nJ\n\n(later\n\nChief\n\nJustice\n\nof\n\nCanada)\n\nsaid,\n\nwith\n\nreference to the Canadian Charter of Rights \"The meaning of a right or freedom guaranteed by the\nCharter was to be ascertained by an analysis of the purpose\nof such a guarantee ; it was to be understood, in other\nwords, in the light of the interests it was meant to\nprotect. In my view this analysis is to be undertaken, and\nthe purpose of the right or freedom in question is to be\nsought by reference to the character and larger objects of\nthe Charter itself, to the language chosen to articulate\nthe specific right or freedom, to the historical origins of\nthe concept enshrined, and where applicable, to the meaning\nand purpose of the other specific rights and freedoms with\nwhich it is associated within the text of the Charter. The\ninterpretation should be .... a generous rather than\nlegalistic one, aimed at fulfilling the purpose of a\nguarantee and the securing for individuals the full benefit\nof the Charter's protection.\"\n\nBoth Lord Wilberforce and Dickson J emphasised that regard\nmust be paid to the legal history, traditions and usages of\nthe country concerned, if the purposes of its constitution\nare be fully understood.\n\nThis must be right.\n\nI may\n\nnonetheless be permitted to refer to what I said in another\ncourt\n\nof\n\nanother\n\nconstitution\n\nalbeit\n\nin\n\na\n\ndissenting\n\njudgment \"Constitutional rights conferred without express limitation\nshould not be cut down by reading implicit restrictions\ninto them, so as to bring them into line with the common\nlaw.\n\nAttorney-General v Moagi 1982(2) Botswana LR 124,184\n\n[16] That caveat is of particular importance in interpreting\nsection 25(3) of the Constitution. The right to a fair\ntrial conferred by that\n\nprovision is broader than the list\n\nof specific rights set out in paragraphs (a) to (j) of the\n\n\f15\nsub-section.\n\nIt embraces a concept of substantive fairness\n\nwhich is not to be equated with what might have passed\nmuster in our criminal courts before the Constitution came\ninto force. In S v Rudman and Another; S v Mthwana 1992(1)\nSA 343(A), the Appellate Division, while not decrying the\nimportance of fairness in criminal proceedings, held that\nthe function of a court of criminal appeal in South Africa\nwas to enquire\n\"whether there has been an irregularity or\nillegality,\nthat is a departure from the formalities, rules and\nprinciples of procedure according to which our law requires\na criminal trial to be initiated or conducted\".\n\nA court of appeal, it was said, (at 377)\n\"does not enquire whether the trial was fair in accordance\nwith 'notions of basic fairness and justice', or with the\n'ideas underlying the concept of justice which are the\nbasis\nof\nall\ncivilised\nsystems\nof\ncriminal\nadministration'.\"\n\nThat was an authoritative statement of the law before 27th\nApril 1994. Since that date section 25(3) has required\ncriminal trials to be conducted in accordance with just\nthose \"notions of basic fairness and justice\".\n\nIt is now\n\nfor all courts hearing criminal trials or criminal appeals\nto give content to those\n\nnotions.\n\n[17] I must also refer to Qozoleni v Minister of Law and Order\n1994(1) BCLR 75(E); 1994(3) SA 625(E).\n\nThe judgment of\n\nFroneman J. contains much of value in its approach to\nconstitutional interpretation.\n\nThe learned judge says (at\n\n\f16\n81) that the previous constitutional system of this country\nwas the fundamental \"mischief\" to be remedied by the new\nConstitution.\n\nHe\n\nsays\n\n(at\n\n80)\n\nthat\n\nbecause\n\nthe\n\nConstitution is the supreme law against which all law is to\nbe tested,\n\"it must be examined with a view to extracting from it\nthose principles or values against which such law ... can\nbe measured.\"\n\nHe adds on the same page that the Constitution must be\ninterpreted so as \"to give clear expression to the values\nit seeks to nurture for a future South Africa.\"\nundoubtedly true.\n\nThis is\n\nSouth African Courts are indeed enjoined\n\nby section 35 of the Constitution to interpret Chapter 3 so\nas\n\n\"to promote the values which underlie an open and\n\ndemocratic society based on freedom and equality\", and,\nwhere\n\napplicable,\n\ninternational law.\n\nto\n\nhave\n\nregard\n\nto\n\nrelevant\n\npublic\n\nThat section also permits our courts to\n\nhave regard to comparable foreign case law.\nI am, however, sure that Froneman J, in his reference to\nthe fundamental \"mischief\" to be remedied, did not intend\nto say that all the principles of law which have hitherto\ngoverned our courts are to be ignored.\n\nThose principles\n\nobviously contain much of lasting value.\n\nNor, I am equally\n\nsure, did the learned judge intend to suggest that we\nshould neglect the language of the Constitution.\n\nWhile we\n\nmust always be conscious of the values underlying the\nConstitution, it is nonetheless our task to interpret a\n\n\f17\nwritten instrument.\nsupposing\n\nthat\n\nI am well aware of the fallacy of\n\ngeneral\n\n\"objective\" meaning.\n\nlanguage\n\nmust\n\nhave\n\na\n\nsingle\n\nNor is it easy to avoid the influence\n\nof one's personal intellectual and moral preconceptions.\nBut\n\nit\n\ncannot\n\nbe\n\ntoo\n\nstrongly\n\nstressed\n\nthat\n\nthe\n\nConstitution does not mean whatever we might wish it to\nmean.\n\n[18] We\n\nmust\n\nheed\n\nLord\n\nWilberforce's\n\nreminder\n\nthat\n\neven\n\na\n\nconstitution is a legal instrument, the language of which\nmust be respected.\n\nIf the language used by the lawgiver is\n\nignored in favour of a general resort to \"values\" the\nresult is not interpretation but divination.\n\nIf I may\n\nagain quote S v Moagi, supra, at 184, I would say that a\nconstitution\n\"embodying fundamental rights should as far as its language\npermits be given a broad construction\"\n\n(My emphasis),\n\n[19] As pointed out above, section 217(1)(b)(ii) creates a legal\npresumption, with the legal burden of rebuttal on the\naccused - what has been called a \"reverse onus\".\n\nThe\n\nlegitimacy of such provisions has been considered by courts\nas varied as the United States Supreme Court, The Canadian\nSupreme Court, the Privy Council and the European Court of\nHuman\n\nRights\n\n(and\n\ndoubtless\n\nothers)\n\nin\n\nthe\n\nlight\n\nof\n\n\f18\nprovisions\n\nentrenching,\n\nin\n\nvarying\n\nlanguage,\n\nthe\n\npresumption of innocence, the right to silence and the\nprivilege against self-incrimination - a privilege not\nexpressly referred to in section 25.\n\nThe case law of\n\nthese courts - which are undoubtedly courts of open and\ndemocratic\n\nsocieties\n\n-\n\nindicates\n\nthat\n\nreverse\n\nonus\n\nprovisions are by no means uncommon and are not necessarily\nunconstitutional.\n\nReverse\n\nonus\n\nprovisions\n\nstatute law are also not uncommon.\n\nin\n\nour\n\nown\n\nTo go no further than\n\nthe Criminal Procedure Act one finds, for example, the\npresumptions arising from entries in marriage registers on\ncharges\n\nof\n\nbigamy\n\n(section\n\n237),\n\nthe\n\npresumption\n\nof\n\nknowledge of falsity arising from proof of a factually\nfalse representation (section 245) and the presumption of\nhaving failed to pay tax arising merely from an allegation\nin a charge sheet (section 249).\ngrappled\nreversing\n\nwith\nthe\n\nthe\nonus\n\nproblem\nof\n\npresumption of innocence.\n\nof\n\nproof\n\nForeign courts have\n\nreconciling\nwith\n\nthe\n\npresumptions\n\nconstitutional\n\nThe different solutions which\n\nthey have suggested are illuminating.\n\n[20] The courts of the United States have over many years\nattempted to enunciate a governing principle.\n\nTot v The\n\nUnited States 319 US 463 (1943) concerned a federal statute\nmaking it an offence for a person convicted of violence to\n\n\f19\nreceive any firearm or ammunition which had been shipped or\ntransported\n\nin\n\ninterstate\n\nor\n\nforeign\n\ncommerce.\n\nThe\n\nstatute provided that \"the possession of a firearm or\nammunition by any such person shall be presumptive evidence\nthat such firearm or ammunition was shipped transported or\nreceived\n\nas\n\nthe\n\ncase\n\nmay\n\nviolation of this Act\".\n\nbe,\n\nby\n\nsuch\n\nperson\n\n...\n\nin\n\nThe Supreme Court held that while\n\nCongress and state legislatures had \"power to prescribe\nwhat evidence is to be received in the courts of the United\nStates\", the due process clauses of the Constitution\n\"set limits upon the power of Congress or that of a state\nlegislature to make the proof of one fact or group of facts\nevidence of the existence of the ultimate fact on which guilt is\npredicated.\" (per Roberts J at 467)\n\nThe test of the validity of such a presumption, the Court\nsaid, was that there be a\n\"rational connection between the facts proved and the fact\npresumed ... . But where the inference is so strained as not to\nhave a reasonable relation to the circumstances of life as we\nknow them it is not competent for the legislature to create it as\na rule governing the procedure of the courts. (467-8)\n\nOn this test the presumption was struck down.\n\nTwenty-five\n\nyears later a somewhat stricter test was formulated.\n\nIn\n\nLeary v United States 395 US 6(1969) the Supreme Court had\nto consider a statute under which possession of marihuana\nwas deemed to be sufficient evidence of the offence of\nillegal importation, unless the defendant explained his\npossession\n\nto\n\nthe\n\nsatisfaction\n\nof\n\nthe\n\njury.\n\nThe\n\npresumption was held to be a denial of due process of law.\n\n\f20\nHaving considered Tot and some later cases, Harlan J,\nspeaking for the Court, said that\n\"a\ncriminal\nstatutory\npresumption\nmust\nbe\nregarded\nas\n'irrational' or 'arbitrary' and hence unconstitutional, unless it\ncan at least be said with substantial assurance that the presumed\nfact is more likely than not to flow from the proved fact on\nwhich it is made to depend.\" (page 36)\n\n(Harlan J added the rider that in this assessment the\nCongressional determination favouring the presumption must\nweigh heavily.)\n\n[21] \"Rational connection\" is a useful screening test, but not\na conclusive one.\n\nThis was acknowledged in County Court\n\nof Ulster County, New York, et al v Allen et al 442 US 140\n(1979).\n\nIn\n\nrelation\n\nto\n\na\n\nmandatory\n\n(i.e.\n\nlegal)\n\npresumption Stevens J giving judgment for the majority of\nthe Supreme Court, said, at 167, that\n\"since the prosecution bears the burden of establishing\nguilt, it may not rest its case entirely on a presumption\nunless the fact proved is sufficient to support the\ninference of guilt beyond a reasonable doubt.\"\n\nThe \"rational connection\" test has been considered in the\nsubstantial jurisprudence which the Canadian courts have\ndeveloped in construing their Charter of Rights.\n\nThe\n\nCanadian cases on reverse onus provisions seem to me to be\nparticularly helpful, not only because of their persuasive\nreasoning, but because section 1 of the Charter has a\nlimitation clause analogous to section 33 of the South\nAfrican\n\nConstitution.\n\napproach.\n\nThis\n\ncalls\n\nfor\n\na\n\n\"two-stage\"\n\nFirst, has there been a contravention of a\n\n\f21\nguaranteed\n\nright?\n\nIf\n\nlimitation clause?\n\nso,\n\nis\n\nit\n\njustified\n\nunder\n\nthe\n\nThe single stage approach (as in the\n\nUS Constitution or the Hong Kong Bill of Rights) may call\nfor a more flexible approach to the construction of the\nfundamental right, whereas the two-stage approach may call\nfor a broader interpretation of the fundamental right,\nqualified only at the second stage.\n\nIn Attorney-General\n\nof Hong Kong v Lee Kwong-kut, [1993] AC 951 (PC), an appeal\nto the Privy Council from Hong Kong, Lord Woolf, while\nnoting that the results of the two approaches often tend to\nbe\n\nsimilar,\n\napproach,\n\nobserved\nin\n\n(at\n\nlaying\n\n967\n\ndown\n\nH)\n\nthat\n\nspecific\n\nthe\n\ntwo-stage\n\ncriteria\n\nof\n\njustification, had important practical consequences.\n\nSee\n\nalso Cachalia & others, Fundamental Rights in the New\nConstitution, pp5-7.\n\n[22] There\n\nare\n\nnumerous\n\nCanadian\n\ncases\n\ndealing\n\nwith\n\nconstitutionality of reverse onus provisions.\nrefer only to three of them.\n\nthe\n\nI shall\n\nIn R v Oakes (1986) 26 DLR\n\n(4th) 200 the Supreme Court of Canada had before it an Act\nof Parliament which provided that if a person was proved to\nbe in unlawful possession of a narcotic he was presumed to\nbe in possession of it for the purposes of trafficking (a\nmore serious offence) unless he proved the contrary.\nproof,\n\nthe\n\nCourt\n\nheld,\n\nhad\n\nto\n\nbe\n\non\n\na\n\nbalance\n\nThis\nof\n\n\f22\nprobabilities.\n\nThis\n\npresumption\n\nwas\n\nheld\n\nto\n\nbe\n\ninconsistent with the presumption of innocence guaranteed\nby section 11(d) of the Canadian Charter of Rights and\nFreedoms.\n\nDickson CJC said at 212-3 -\n\n\"The presumption of innocence protects the fundamental\nliberty and human dignity of any and every person accused\nby the State of criminal conduct. An individual charged\nwith a criminal offence faces grave social and personal\nconsequences, including potential loss of physical liberty,\nsubjection to social stigma and ostracism from the\ncommunity, as well as other social, psychological and\neconomic harms.\nIn light of the gravity of these\nconsequences, the presumption of innocence is crucial. It\nensures that until the State proves an accused's guilt\nbeyond all reasonable doubt, he or she is innocent. This\nis essential in a society committed to fairness and social\njustice.\"\n\nAnd, at 222,\n\"If an accused bears the burden of disproving on a balance\nof probabilities an essential element of an offence, it\nwould be possible for a conviction to occur despite the\nexistence of a reasonable doubt. This would arise if the\naccused adduced sufficient evidence to raise a reasonable\ndoubt as to his or her innocence but did not convince the\njury on a balance of probabilities that the presumed fact\nwas untrue.\"\n\nHe held further that the \"rational connection\" test, while\npossibly useful at the stage when the State sought to\njustify an infringement of a guaranteed right in terms of\nsection 1 of the Charter, was not in itself an adequate\nprotection for the constitutional presumption of innocence.\n\"A basic fact may rationally tend to prove a presumed fact,\nbut not prove its existence beyond a reasonable doubt. An\naccused person could thereby be convicted despite the\npresence of a reasonable doubt.\nThis would violate the\npresumption of innocence.\"\n\n[23] R v Whyte (1988) 51 DLR (4th ) 481 concerned a statute\ncreating the offence of having care or control of a motor\n\n\f23\nvehicle\n\nwhile\n\nalcohol.\n\none's\n\nability\n\nto\n\ndrive\n\nwas\n\nimpaired\n\nby\n\nUnder the statute, upon proof that the accused\n\noccupied the driver's seat he was deemed to have the care\nand control of the vehicle unless he established that he\ndid not enter the vehicle for the purpose of setting it in\nmotion.\n\nThis presumption, too, was held to be a violation\n\nof the right to the presumption of innocence.\n\nThe Supreme\n\nCourt, again speaking through Dickson CJC, held that it was\nirrelevant\n\nthat\n\nthe\n\npresumption\n\ndid\n\nnot\n\nrelate\n\nto\n\nan\n\n\"essential element\" in the offence (cf R v Oakes, supra at\n222).\n\nThe Chief Justice, at 493, said \"In the case at bar, the Attorney-General of Canada argued\nthat since the intention to set the vehicle in motion is\nnot an element of the offence, s. 237(1)(a) does not\ninfringe the presumption of innocence. Counsel relied on\nthe passage from Oakes quoted above, with its reference to\nan \"essential element\", to support this argument.\nThe\naccused here is required to disprove a fact collateral to\nthe substantive offence, unlike Oakes where the accused was\nrequired to disprove an element of the offence.\nThe short answer to this argument is that the distinction between\nelements of the offence and other aspects of the charge is\nirrelevant to the s. 11(d) inquiry.\nThe real concern is not\nwhether the accused must disprove an element or prove an excuse,\nbut that an accused may be convicted while a reasonable doubt\nexists. When that possibility exists, there is a breach of the\npresumption of innocence.\nThe exact characterization of a factor as an essential\nelement, a collateral factor, an excuse, or a defence\nshould not affect the analysis of the presumption of\ninnocence. It is the final effect of a provision on the\nverdict that is decisive.\nIf an accused is required to\nprove some fact on the balance of probabilities to avoid\nconviction, the provision violates the presumption of\ninnocence because it permits a conviction in spite of a\nreasonable doubt in the mind of the trier of fact as to the\nguilt of the accused.\"\n\n[24] In 1992, in R v Downey 90 DLR (4th) 449, the Supreme Court\n\n\f24\nof Canada dealt with a statutory presumption that a person\nwho\n\nlives\n\nwith\n\nprostitutes,\n\nor\n\nis,\n\nis\n\nin\n\nhabitually\n\nthe\n\nabsence\n\nin\nof\n\nthe\n\ncompany\n\nevidence\n\nto\n\nof\nthe\n\ncontrary, committing the offence of \"living on the avails\n[i.e. proceeds] of another person's prostitution\".\n\nThis\n\npresumption was also held to infringe the presumption of\ninnocence (although it was held by a majority to be in all\nthe\n\ncircumstances\n\na\n\njustifiable\n\ninfringement.)\n\nThe\n\njudgment of Cory J at 456 contains a useful analysis of\ndifferent types of presumption.\n\nThe type with which we\n\nare concerned in section 217(1)(b)(ii) is described as a\nlegal\n\npresumption\n\n\"where\n\nthe\n\npresumed\n\nfact\n\nmust\n\nbe\n\ndisproved on a balance of probabilities instead of by the\nmere raising of evidence to the contrary\".\n\nThis is what\n\nthe Canadian courts refer to as a \"reverse onus\" clause, as\nI do in this judgment.\n\n[25] Cory J at 461 summarised the principles derived from the\nauthorities in seven propositions.\n\nI shall quote the first\n\nthree\"I.\n\nII.\n\nIII.\n\nThe presumption of innocence is infringed whenever\nthe accused is liable to be convicted despite the\nexistence of a reasonable doubt.\nIf by the provisions of a statutory presumption, an\naccused is required to establish, that is to say to\nprove or disprove, on a balance of probabilities\neither an element of an offence or an excuse, then it\ncontravenes s. 11(d). Such a provision would permit\na conviction in spite of a reasonable doubt.\nEven if a rational connection exists between the\nestablished fact and the fact to be presumed, this\nwould be insufficient to make valid a presumption\nrequiring the accused to disprove an element of the\n\n\f25\noffence.\"\n\nSection 11(d) of the Canadian Charter provides that any\nperson charged with an offence has the right\n\"(d)\n\nto be presumed innocent until proven guilty according\nto law in a fair and public hearing by an independent\nand impartial tribunal\".\n\nThis bears a close relationship to section 25(3)(a) and (c)\nof our Constitution.\n\nIn both Canada and South Africa the\n\npresumption of innocence is derived from the centuries-old\nprinciple of English law, forcefully restated by Viscount\nSankey in his celebrated speech in Woolmington v Director\nof Public Prosecutions [1935] AC 462 (HL), 481, that it is\nalways for the prosecution to prove the guilt of the\naccused person, and that the proof must be proof beyond a\nreasonable doubt.\nappropriately\nCanadian\n\nAccordingly, I consider that we may\n\napply\n\nSupreme\n\nthe\n\nCourt\n\nprinciples\nin\n\nworked\n\nparticular\n\nout\n\nthe\n\nby\n\nthe\n\nfirst\n\ntwo\n\nprinciples stated by Cory J, supra.\n\n[26] Does\n\nthe\n\napplication\n\nof\n\nthese\n\nprinciples\n\nin\n\nitself\n\ndemonstrate a violation of the presumption of innocence in\nsection\n\n217(1)(b)(ii)?\n\ncontended that it did not.\n\nMr\n\nd'Oliviera\n\nfor\n\nthe\n\nState\n\nThe admission of a confession,\n\nhe said, did not conclude the prosecution in favour of the\nState.\n\nThus in the present case further evidence might\n\nentitle the trial court in this case to review its finding\n\n\f26\nthat the accused had not discharged the onus on them.\nThere might also be evidence which would lead a court to\nfind that a confession, although admissible, was untrue.\nMoreover, the presumption did not relate to any element of\nthe offence charged, but merely to the voluntary character\nof the confession.\n\nThis was no more than a question of\n\nadmissibility of evidence.\n\n[27] These arguments were persuasively presented, but in my view\nthey cannot be accepted.\n\nA confession by definition is an\n\nadmission of all the elements of the offence charged, a\nfull acknowledgment of guilt.\n\nR v Becker 1929 AD 167.\n\nNo\n\ndoubt in some cases additional evidence (for example, that\nthe\n\nconfession\n\nis\n\nfalse)\n\nwill\n\nlead\n\nto\n\nan\n\nnotwithstanding the admission of the confession.\n\nacquittal\nBut the\n\nvalidity of the presumption is not to be tested on a case\nby case basis.\n\nIn the absence of other evidence the\n\npresumption, unrebutted, stands throughout the trial.\n\nIt\n\ncould therefore happen that, given proof aliunde of the\ncrime itself (section 209 of the Criminal Procedure Act),\na conviction could follow from an admissible confession,\nnotwithstanding the court's reasonable doubt that it was\nfreely and voluntarily made.\n\nThe practical effect of the\n\npresumption is that the accused may be required to prove a\nfact on the balance of\n\nprobabilities in order to avoid\n\n\f27\nconviction.\n\nCf.\n\nR\n\nv\n\nWhyte,\n\nsupra,\n\nloc.\n\ncit.\n\n(last\n\nparagraph).\n\n[28] In the course of argument I asked Mr d'Oliviera whether, if\nthere were no further evidence, the trial court in this\ncase could properly give expression to its doubts as to the\nvoluntariness of the confession by acquitting the accused.\nMr\n\nd'Oliviera\n\nunderstood\n\nsubmitted\n\nhim,\n\nby\n\nthe\n\nthat\n\nit\n\njudge's\n\ncould\n\ndo\n\nexercising\n\nso\na\n\n-\n\nas\n\nI\n\njudicial\n\ndiscretion to reject admissible but unfairly prejudicial\nevidence.\n\nThe authority for the existence of such a\n\ndiscretion\n\nis\n\nconflicting.\n\nSee\n\nR\n\nv\n\nRoets\n\nand\n\nAnother\n\n1954(3) SA 512(A), 520; S v Mkanzi and Another 1979(2) SA\n757(T); S v Mphahlele supra.\n\nEven if there is such a\n\ndiscretion and even if it could be exercised so as to\novercome\n\na\n\nstatutory\n\npresumption\n\n(surely\n\na\n\ndoubtful\n\nproposition)1 that gives rise to no more than a possibility\nof an acquittal; the possibility of a conviction remains.\nThe presumption of innocence cannot depend on the exercise\nof discretion.\n\n[29] The suggestion that the common law rule placing the onus of\n\nIn England there appears to be a judicial discretion to exclude an admissible confession, for example\nbecause the methods used to obtain it, while not unlawful, were unfair. R v Sang [1980] A.C. 402 (HL), 437.\n\n\f28\nproving voluntariness on the prosecution is merely a rule\nof evidence and can therefore be freely altered by the\nlegislature deserves and requires fuller consideration. In\npart it is answered by the quotation from Tot v United\nStates of America, supra.\n\nIn Tregea and Another v Godart\n\nand Another 1939 AD 16, 32 Stratford CJ said that if a\nrebuttable presumption of law shifts the burden of proof it\nis not a mere rule of evidence but a matter of substantive\nlaw.\n\nBut\n\neven\n\nif\n\nthe\n\ncommon\n\nlaw\n\nrule\n\ngoverning\n\nthe\n\nadmissibility of confessions is a rule of evidence, it is,\nas\n\nI\n\nshall\n\nshow,\n\na\n\nrule\n\nwhich\n\nlies\n\nat\n\nthe\n\nheart\n\nof\n\nimportant rights embodied in section 25, including the\nright to remain silent after arrest, the right not be\ncompelled\n\nto\n\nmake\n\na\n\nconfession\n\nwhich\n\ncan\n\nbe\n\nused\n\nin\n\nevidence, the right to be presumed innocent and the right\nnot to be a compellable witness against oneself.\n\n[30] The rule itself derives from more than 300 years of English\nlegal history.\n\nBy the latter half of the 18th century the\n\nrule was clearly stated in its modern form\"A confession forced from the mind by the flattery of hope\nor by the torture of fear comes in so questionable a shape,\nwhen it is to be considered as evidence of guilt, that no\ncredit ought to be given to it\" -\n\nR v Warwickshall (1783) 1 Leach, 263.\n\nIn Ibrahim v R [1914] AC 599 (PC) at 610 Lord Sumner said\nthat this was a rule of policy. It would appear that the\n\n\f29\nrule\n\nderived\n\nfrom\n\na\n\ndetermination\n\nto\n\neradicate\n\nthe\n\noppressive and often barbaric methods of interrogation\nemployed by the Star Chamber in 17th century England to\nextract\n\nconfessions\n\nfrom\n\naccused\n\npersons.\n\nFrom\n\nthe\n\nabhorrence of those methods there developed the privilege\nagainst self-incrimination, and the right of silence, one\naspect of which is the exclusion of compelled confessions,\nwith the onus placed on the prosecution to prove beyond\nreasonable\nvoluntary.\n\ndoubt\n\nthat\n\nany\n\nconfession\n\nrelied\n\non\n\nwas\n\nIn Smith v Director of Serious Fraud Office\n\n[1993] AC 1 (HL) Lord Mustill distinguished the \"disparate\ngroup of immunities\" denoted by the expression \"the right\nto silence\".\n\nAt 32 Lord Mustill observed that the law\n\nrelating to proof of the voluntariness of confessions was\nparticularly important at a time when an accused was not\nentitled to give evidence on his own behalf - a disability\nremoved in England only in 1898.\n\nNonetheless, Lord Mustill\n\nsaid,\n\"Even now, nearly hundred years after that disability has\nbeen removed, the imprint of the old law is still clearly\nto be seen.\"\n\nIt is indeed.\n\n[31] In Lam Chi-Ming v R, [1991] 2 AC 212 (PC), 220, an appeal\nto the Privy Council from Hong Kong, Lord Griffiths said\"Their lordships are of the view that the more recent\nEnglish cases established that the rejection of an\nimproperly obtained confession is not dependent only upon\npossible unreliability but also upon the principle that a\nman cannot be compelled to incriminate himself and upon the\n\n\f30\nimportance that attaches in a civilised society to proper\nbehaviour by the police towards those in their custody. All\nthree of these factors have combined to produce the rule of\nlaw applicable in Hong Kong as well as in England that a\nconfession is not admissible in evidence unless the\nprosecution establish that it was voluntary. This, perhaps\nthe most fundamental rule of the English criminal law, now\nfinds expression in England in section 76 of the Police and\nCriminal Evidence Act 1984.\"\n\nIn Wong Kam-ming v R [1980] AC 247 (PC), 261, Lord Hailsham\nstated the underlying principle in memorable words\"any civilised system of criminal jurisprudence must accord\nto the judiciary some means of excluding confessions or\nadmissions obtained by improper methods. This is not only\nbecause of the potential unreliability of such statements,\nbut also, and perhaps\nmainly, because in a civilised\nsociety it is vital that persons in custody or charged with\noffences should not be subjected to ill treatment or\nimproper pressure in order to extract confessions. It is\ntherefore of very great importance that the courts should\ncontinue to insist that before extra-judicial statements\ncan be admitted in evidence the prosecution must be made\nto prove beyond reasonable doubt that the statement was not\nobtained in a manner which should be reprobated and was\ntherefore in the truest sense voluntary.\"\n\nIn South Africa, too, courts have over the years recognised\nthe origins and the importance of the common law rule. In\nR v Camane and Others 1925 AD 570, 575 Innes CJ said\"Now, it is an established principle of our law that no\none can be compelled to give evidence incriminating\nhimself. He cannot be forced to do that either before the\ntrial, or during the trial.\nThe principle comes to us\nthrough the English law, and its roots go far back in\nhistory. Wigmore, in his book on Evidence (vol IV, sec.\n2250) traces very accurately the genesis, and indicates the\nlimits of the privilege. And he shows that, however\nimportant the doctrine may be, it is necessary to confine\nit within its proper limits.\nWhat the rule forbids is\ncompelling a man to give evidence which incriminates\nhimself.\"\n\n[32] In R v Gumede and Another 1942 AD 398, 412-4, Feetham JA\nreferred to the embodiment of the rule in the Criminal\nProcedure and Evidence Act 1917, and\n\nnoted that its first\n\n\f31\nappearance in South Africa was in Ordinance No 72 of 1830\nof the Cape of Good Hope. There was no doubt, he said, that\nthe Ordinance was intended to apply to the Cape Colony the\ncommon law of England in regard to the\n\nburden of proof\n\nresting on the prosecution when asking a criminal court to\nadmit a confession alleged to have been made by an accused\nperson. He cited the cases of R v Warwickshall, supra and\nIbrahim v R, supra,\n\nas did Nicholas AJA, in his detailed\n\nexamination of the rule in S v de Vries, supra, 232-4.\n\n[33] The conclusion which I reach, as a result of this survey,\nis that the common law rule in regard to the burden of\nproving that a confession was voluntary has been not a\nfortuitous but an integral and essential part of the right\nto\n\nremain\n\nsilent\n\nafter\n\narrest,\n\nthe\n\nright\n\nnot\n\nto\n\nbe\n\ncompelled to make a confession, and the right not to be a\ncompellable witness against oneself.\n\nThese rights, in\n\nturn, are the necessary reinforcement of Viscount Sankey's\n\"golden thread\" - that it is for the prosecution to prove\nthe\n\nguilt\n\nof\n\nthe\n\naccused\n\nbeyond\n\nreasonable\n\ndoubt\n\n(Woolmington's case, supra).\n\nReverse the burden of proof\n\nand\n\nseriously\n\nall\n\nthese\n\nundermined.\non\n\nthe\n\nrights\n\nare\n\ncompromised\n\nand\n\nI therefore consider that the common law rule\n\nburden\n\nof\n\nproof\n\nis\n\ninherent\n\nin\n\nthe\n\nrights\n\nspecifically mentioned in section 25(2) and (3)(c) and (d),\n\n\f32\nand forms part of the right to a fair trial.\n\nIn so\n\ninterpreting these provisions of the Constitution I have\ntaken account of the historical background, and comparable\nforeign case law.\n\nI believe too that this interpretation\n\npromotes the values which underlie an open and democratic\nsociety and is entirely consistent with the language of\nsection 25.\n\nIt follows that section 217(1)(b)(ii) violates\n\nthese provisions of the Constitution.\n\n[34] I should add that I prefer not to consider in this judgment\nthe meaning and scope of the right to silence during trial.\nIt is unnecessary to decide whether section 217(1)(b)(ii)\nviolates that right.\n\n[35] The\n\nState\n\nsubmitted,\n\nin\n\nthe\n\nalternative,\n\nthat\n\nif\n\nthe\n\nproviso in question is a violation of fundamental rights,\nit\n\nis\n\none\n\nwhich\n\nConstitution.\ngeneral\n\nis\n\nsaved\n\nby\n\nsection\n\n33(1)\n\nof\n\nthe\n\nThe proviso, it was argued, was a law of\n\napplication\n\nwhich\n\nwas\n\n(i)\n\nreasonable,\n\n(ii)\n\njustifiable in an open and democratic society based on\nfreedom and equality, under paragraph (a) of the subsection and was also \"necessary\" in terms of paragraph (b).\nMuch written and oral argument was addressed to us on the\nCanadian approach to the broadly\n\nanalogous provision in\n\nsection 1 of the Canadian Charter, which guarantees the\n\n\f33\nrights and freedoms set out in that document\n\"subject only to such reasonable limits prescribed by law\nas can be demonstrably justified in a free and democratic\nsociety\".\n\nThe\n\nCanadian\n\ncourts\n\nhave\n\nevolved\n\ncertain\n\ncriteria,\n\nin\n\napplying this section, such as the existence of substantial\nand pressing public needs which are met by the impugned\nstatute.\n\nThere,\n\nif\n\nthe\n\nstatutory\n\nviolation\n\nis\n\nto\n\nbe\n\njustified it must also pass a \"proportionality\" test, which\nthe courts dissect into several components.\nv Chaulk (1991) 1 CRR (2d) 1.\n\nSee, e.g. R\n\nThese criteria may well be\n\nof assistance to our courts in cases where a delicate\nbalancing of individual rights against social interests is\nrequired.\n\nBut section 33(1) itself sets out the criteria\n\nwhich we are to apply, and I see no reason, in this case at\nleast, to attempt to fit our analysis into the Canadian\npattern.\n\n[36] As to reasonableness I am prepared to assume that the\npresumption passes the \"rational connection\" test, although\nI am not convinced of this.\n\nBut that does not in itself\n\nexplain why it should be thought reasonable to undermine a\nlong-established and now entrenched right.\nreasonableness,\n\njustifiability\n\nand\n\nThe tests of\n\nnecessity\n\nare\n\nnot\n\nidentical, and in applying each of them individually one\nwill\n\nnot\n\nalways\n\nget\n\nthe\n\nsame\n\nresult.\n\nBut\n\nin\n\nthis\n\n\f34\nparticular\n\ninstance\n\nreasonableness,\n\njustification\n\nnecessity may be looked at and assessed together.\nState's problems here are manifold.\nwith\n\nare\n\nfundamental\n\nforensic fairness.\nover 150 years.\n\nto\n\nour\n\nand\nThe\n\nThe rights interfered\n\nconcepts\n\nof\n\njustice\n\nand\n\nThey have existed in this country for\n\nA drastic consequence of the alteration to\n\nthe law brought about by section 217(1)(b)(ii) is the\npossibility that an accused may be convicted over the\nreasonable doubt of the court.\n\nNor has it been shown that\n\nit is in practice impossible or unduly burdensome for the\nState to discharge its onus; it has done so successfully in\ninnumerable\n\ntrials\n\nunder\n\nthe\n\ncommon\n\nlaw\n\nrule.\n\nThe\n\ncircumstances in which an accused person agreed to make a\nconfession\n\nare\n\nnot\n\npeculiarly\n\nwithin\n\nhis\n\nor\n\nher\n\nown\n\nknowledge.\n\nWhat then is the rationale of the proviso?\n\nThe\n\nanswer, it seems (and we have been given no other) lies in\nthe Report of the Botha Commission into criminal procedure\nand evidence (RP 78/1971).\n\nThe extract I quote here is\n\ntaken from the written submissions on behalf of the accused\nin this case.\n\"5.31.3. It is however a disquieting phenomenon that\naccused persons, after having made a confession to a\nmagistrate which was confirmed and reduced to writing in\nthe presence of a magistrate or justice, far too frequently\nand sometimes under the influence of others and in spite of\ntheir contrary allegations to the magistrate or justice,\nallege at their trial that the confession was in fact\nimproperly obtained from them and is therefore inadmissible\nin evidence with the result that, notwithstanding the\naccused's erstwhile allegations, the admissibility thereof\nhas, far too frequently, to be determined at an extended\nhearing where the onus rests upon the State throughout. As\na judicial officer a magistrate is peculiarly equipped and\n\n\f35\nable, with the aid of his personal observation and\npreceding interrogation of the person who makes the\nconfession, to come to a prima facie conclusion in regard\nto the question whether the confession was or is being made\nfreely and voluntarily by such person in his sound and\nsober senses without having been unduly influenced thereto,\nand it is highly improbable that a magistrate would take a\nconfession from someone unless he is convinced of the\nexistence\nof\nthe\nprescribed\nrequirements\nfor\nthe\nadmissibility thereof. In view of these considerations,\nand to give meaning to the making or confirmation of a\nconfession to or in the presence of a magistrate, the\nCommission is of the opinion that, where a confession was\nmade to a magistrate and reduced to writing, or confirmed\nand reduced to writing in the presence of a magistrate, it\nshould at the trial of that person for an offence to which\nthe confession relates, be presumed, unless that person\nproved the contrary (that is to say, on a balance of\nprobabilities) that the confession was made freely and\nvoluntarily by such person in his sound and sober senses\nwithout having been unduly influenced thereto.\nThe\nCommission therefore recommends that a further proviso to\nthis effect be added to section 244(1) with reference to a\nconfession made to a magistrate or confirmed and reduced to\nwriting in the presence of a magistrate. Such a provision\nwould considerably shorten and may eliminate the extent of\nthe so called trials within a trial.\"\n\nIt appears from this passage that the harm which the new\nproviso was intended to overcome was twofold.\n\nFirst, some\n\naccused attempt dishonestly to retract confessions which\nthey have made before a magistrate.\n\nSecond, this leads to\n\nunduly long trials within trials.\n\nThe justification of the\n\namendment,\n\ntherefore,\n\nit\n\ndifficult\n\nfor\n\nthe\n\nwas\n\nthat\n\ndishonest\n\nwould\n\naccused\n\nto\n\nmake\n\nit\n\nmake\n\nmore\nfalse\n\nallegations of duress, and that this would shorten trials.\n\n[37] As to the first head of justification, the objective is\nlaudable.\n\nBut the reasoning of the Commission seems to\n\noverlook the interests of an accused who has in fact been\nsubject to duress.\nits\n\nReport,\n\nThe Commission itself, in para 5.23 of\n\nrecognised\n\nthat\n\nan\n\napparently\n\nvoluntary\n\n\f36\nconfirmation of a confession before a magistrate \"may be\nmisleading,\n\nwhere\n\nthe\n\nconfession\n\nwas\n\nin\n\nfact\n\nforced\n\nbeforehand by improper interrogation or inducement by the\npolice.\"\nthe\n\nThere is nothing before this Court to show that\n\ncommon\n\nlaw\n\nrule\n\ncaused\n\nadministration of justice.\n\nsubstantial\n\nharm\n\nto\n\nthe\n\nThe Commission points to the\n\nimprobability of a magistrate taking a confession unless\nconvinced of its voluntariness.\n\nThat may well be an\n\nimprobability in most cases, but why that should justify\nplacing a burden of proof on the accused I am unable to\nfollow.\n\nThat improbability has always weighed\n\nagainst an\n\naccused and will continue to do so, without resort to the\nproviso.\n\nIn any event there is nothing in the Criminal\n\nProcedure Act which obliges a magistrate to conduct any\nparticular preliminary enquiry into voluntariness.\nAttorneys-General\n\nand\n\nmagistrates\n\nhave\n\ndrafted\n\nSome\n\nhelpful\n\nquestionnaires for the use of magistrates or justices of\nthe peace before recording a confession.\n\nBut there is no\n\nstandard form and none with statutory provenance.\n\n[38] The reverse onus may in some cases obviate or shorten the\ntrial within a trial.\nwho have had\n\nThose of my colleagues on the Court\n\nconsiderable experience of criminal trials\n\ndoubt that is so.\n\nEven if it were the case, and even if it\n\ndid release police or prosecution from the inconvenience of\n\n\f37\nmarshalling and calling their witnesses before the accused\ngave evidence, I cannot regard those inconveniences as\noutweighing and justifying the substantial infringement of\nthe important rights which I have identified.\n\nThe argument\n\nfrom convenience would only have merit in situations where\naccused persons plainly have more convenient access to\nproof, and where the reversed burden does not create undue\nhardship or unfairness.\n\nCf R v Oakes (1983) 3 CRR\n\n304, per Martin JA in the Ontario Court of Appeal.\n\n289,\n\nThat is\n\nnot the case here.\n\n[39] Accordingly, section 217(b)(ii) does not meet the criteria\nlaid down in section 33(1) of the Constitution.\n\nIt is\n\ninconsistent with the Constitution and in terms of section\n98(5) of the Constitution, it must be declared invalid.\n\n[40] It follows that in my opinion the ruling given by Levinsohn\nJ in S v Shangase and Another 1994(2) BCLR 42(D); 1995(1)\nSA 425(D) was correct.\n\n[41] It is important, I believe, to emphasise what this judgment\ndoes not decide.\n\nIt does not decide that all statutory\n\nprovisions which create presumptions in criminal cases are\ninvalid.\n\nThis Court recognises the pressing social need\n\nfor the effective prosecution of crime, and that in some\n\n\f38\ncases the prosecution may require reasonable presumptions\nto assist it in this task.\ntypes.\n\nPresumptions are of different\n\nSome are no more than evidential presumptions,\n\nwhich give certain prosecution evidence the status of prima\nfacie proof, requiring the accused to do no more than\nproduce credible evidence which casts doubt on the prima\nfacie proof.\n\nSee e.g. the presumptions in section 212 of\n\nthe Criminal Procedure Act.\nto such presumptions.\n\nThis judgment does not relate\n\nNor does it seek to invalidate\n\nevery legal presumption reversing the onus of proof.\nmay\n\nbe\n\njustifiable\n\nas\n\nbeing\n\nrational\n\nin\n\nSome\n\nthemselves,\n\nrequiring an accused person to prove only facts to which he\nor she has easy access, and which it would be unreasonable\nto expect the prosecution to disprove.\n\nThe provisions in\n\nsection 237 of the Act (evidence on charge of bigamy) may\nbe of this type.\nnecessary\n\nif\n\nOr there may be presumptions which are\n\ncertain\n\noffences\n\nare\n\nto\n\nbe\n\neffectively\n\nprosecuted, and the State is able to show that for good\nreason\nitself.\n\nit\n\ncannot\n\nbe\n\nexpected\n\nto\n\nproduce\n\nthe\n\nevidence\n\nThe presumption that a person who habitually\n\nconsorts with prostitutes is living off the proceeds of\nprostitution was upheld on that basis in R v Downey supra\nby the Supreme Court of Canada.\n\nA similar presumption in\n\na United Kingdom statute was upheld by the European Court\nof Human Rights in X v United Kingdom (Application No\n\n\f39\n5124/71, Collection of Decisions, ECHR 135).\nsuch a case.\n\nThis is not\n\nNor does this judgment deal with statutory\n\nprovisions which are in form presumptions but which in\neffect\n\ncreate\n\nnew\n\noffences.\n\nSee\n\nAttorney-General\n\nv\n\nOdendaal 1982 Botswana LR 194, 226-7.\n\n[42] I would also make clear that this judgment does not purport\nto apply to exceptions, exemptions or provisos to statutory\noffences,\n\nreferred\n\nto\n\nin\n\nsection\n\n90\n\nof\n\nthe\n\nCriminal\n\nProcedure Act and in the extensive case law on that section\nand its predecessors.\n\nNor, of course, does it deal with\n\nthe factors governing the creation of offences of strict\nliability, discussed in Amalgamated Beverage Industries\nNatal (Pty) Ltd v Durban City Council 1994(3) SA 170 and\n646(A), although the considerations weighed in that case\nmay not be irrelevant to the constitutional validity of\ncertain statutory presumptions.\n\n[43] It is necessary, finally, to consider what order, if any,\nshould be made under section 98(6) of the Constitution\nconsequent upon the finding of invalidity.\n\nThe terms of\n\nthat sub-section are as follows \"(6) Unless the Constitutional Court in the interests of\njustice and good government orders otherwise, and save to\nthe extent that it so orders, the declaration of invalidity\nof a law or a provision thereof -\n\n\f40\n(a)\n\nexisting\nat\nthe\nConstitution, shall\ndone or permitted in\ncoming into effect\ninvalidity ;or\n\ncommencement\nof\nthis\nnot invalidate anything\nterms thereof before the\nof such declaration of\n\n(b)\n\npassed\nafter\nsuch\ninvalidate everything\nterms thereof.\n\ncommencement,\nshall\ndone or permitted in\n\nParagraph (a) of the sub-section applies in this case.\nAbsent a specific order by this Court, any decision by a\ntrial court admitting a confession in reliance on section\n217(1)(b)(ii), given before the date of the declaration of\nits invalidity, would stand.\nsome\n\naccused\n\npersons.\n\nThis would be unfortunate for\n\nBut\n\nif\n\nwe\n\nwere\n\nto\n\ngive\n\nour\n\ndeclaration full retrospective effect in terms of section\n98(6)\n\nso\n\nas\n\nto\n\ninvalidate\n\nsuch\n\nearlier\n\nrulings\n\non\n\nadmissibility the likely result of such order would be\nnumerous appeals with the possibility of proceedings de\nnovo under sections 313 or 324 of the Criminal Procedure\nAct. In proceedings de novo the necessary evidence of\nvoluntariness may no longer be available.\n\nParagraph (a) of\n\nsection 98(6) is intended to ensure that the invalidation\nof a statute existing at the date of commencement of the\nConstitution should not ordinarily have any retrospective\neffect, so as to avoid the dislocation and inconvenience of\nundoing transactions, decisions or actions taken under that\nstatute.\n\nThis Court's power to order otherwise in the\n\ninterests\n\nof\n\njustice\n\nexercised circumspectly.\n\nand\n\ngood\n\ngovernment\n\nshould\n\nbe\n\nIn some cases (and I believe that\n\n\f41\nthis is one of them) the interests of individuals must be\nweighed against the interest of avoiding dislocation to the\nadministration of justice and the desirability of a smooth\ntransition from the old to the new. We should also take\ninto\n\naccount\n\nthe\n\nprosecution\n\nfact\n\nhave\n\n217(1)(b)(ii).\n\nthat\n\nhitherto\n\nlegitimately\n\nthe\n\nrelied\n\npolice\non\n\nand\n\nsection\n\nCf. the approach of the United States\n\nSupreme Court in such cases as Linkletter v Walker 381 US\n618 (1965) and Stovall v Denno 388 US 293 (1967).\n\n[44] The application of section 217(1)(b)(ii) since 27 th April,\n1994 may well have caused injustice to accused persons, but\nwe cannot repair all past injustice by a simple stroke of\nthe pen.\n\nWeighing all the relevant considerations it seems\n\nto me that the proper balance can be struck by invalidating\nthe admission of any confession in reliance on section\n217(1)(b)(ii) before the date of our declaration, but in\nrespect only of trials begun on or after 27th April, 1994,\nand not completed at the date of delivery of this judgment.\nThe\n\neffect\n\nmight\n\nbe\n\nin\n\nthose\n\ntrials\n\nto\n\nrequire\n\nreconsideration of the admissibility of confessions already\nadmitted,\nWhether\n\nincluding\n\nan\n\norder\n\nthe\nunder\n\nhearing\nsection\n\nof\n\nfurther\n\n98(6)\n\nmay\n\nevidence.\nor\n\nshould\n\nencompass proceedings which were pending before 27th April,\n1994,\n\ndepends\n\non\n\nthe\n\nproper\n\ninterpretation\n\nof\n\nsection\n\n\f42\n241(8) of the Constitution.\n\nAs indicated at the beginning\n\nof the judgment, that issue is deferred for determination\nin the Mhlungu case.\n\n[45] In the present case the trial judge has given no decision\non the admissibility of the confessions, so that no special\norder need be made in respect of it.\n\n[46] In conclusion, we should like to express our indebtedness\nto Mr A Findlay S.C. and his colleagues, of the Durban Bar,\nwho appeared for the accused persons at the request of the\nCourt.\n\nThe following order is accordingly made :-\n\n1\n\nIt is declared that section 217(1)(b)(ii) of the\nCriminal Procedure Act, 1977, is invalid.\n\n2\n\nIn terms of sub-section (6) of section 98 of the\nConstitution it is ordered that this declaration\nshall invalidate any application of the said\nsection 217(1)(b)(ii) in any criminal trial which\ncommenced on or after 27th April, 1994, and in\nwhich the verdict has not at the date of this\norder been given.\n\n______________________________\nS.KENTRIDGE\nACTING JUDGE OF THE CONSTITUTIONAL COURT\n\nWe concur in the judgement of Kentridge AJ:\n\nChaskalson P\n\n\f43\nAckermann J\n\nDidcott J\n\nKriegler J\n\nLanga J\n\nMadala J\n\nMahomed J\n\nMokgoro J\n\nO'Regan J\n\nSachs J\n\nCASE NO\n\n:\n\nCCT/5/94\n\nCOUNSEL FOR APPLICANT\n\n:\n\nA. Findlay SC\nMJD Wallis SC\nPJ Olsen\nM. Mkize\nK Govender\n\nINSTRUCTED BY\n\n:\n\nCOUNSEL FOR RESPONDENT\n\n:\n\nJA van S d'Oliveira SC\nJWS de Villiers\nI Stretch\n\n\f44\nEA Erasmus\nSM Galloway\n\nINSTRUCTED BY\n\n:\n\nDATE OF HEARING\n\n:\n\n23 February 1995\n\nDATE OF JUDGMENT\n\n:\n\n5 April 1995\n\n\f"}}], "1996": [{"title": "S v Mbatha, S v Prinsloo (CCT19/95, CCT35/95) [1996] ZACC 1; 1996 (3) BCLR 293; 1996 (2) SA 464 (9 February 1996)", "url": "http://www.saflii.org/za/cases/ZACC/1996/1.html", "summary_document": {"filename": "1media.pdf", "file_url": "http://www.saflii.org/za/cases/ZACC/1996/1media.pdf", "file_content": "S v Mbatha\nCase CCT 19/95\nExplanatory Note\n\nThe following explanation is provided to assist the media in reporting this case and is not\nbinding on the Constitutional Court or any member of the Court.\nThe applicants in both cases challenged the constitutionality of section 40(1) of the Arms and\nAmmunitions Act 75 of 1969 which contains a presumption to assist the state prove\npossession of unlawful possession of arms and ammunition. The presumption provides:\nWhenever in any prosecution for being in possession of any article contrary to the provisions\nof this Act, it is proved that such article has at any time been on or in any premises, including\nany building, dwelling, flat, room, office, shop, structure, vessel, aircraft or vehicle or any\npart thereof, any person who at that time was on or in or in charge of or present at or\noccupying such premises, shall be presumed to have been in possession of that article at that\ntime, until the contrary is proved.\nThe Court classified the presumption in s 40(1) as a 'reverse-onus' provision because it\nshifted the burden of proof of guilt away from the State to the accused to disprove the\npresumed fact on a balance of probabilities. In this case the fact presumed was 'possession'\nwhich constituted an essential element of the offence. The presumption required the accused\nto disprove 'possession' on a balance of probabilities. This meant that even if the accused\nestablished a reasonable doubt he or she could still be convicted for failing to disprove the\npresumed fact on a balance of probabilities.\nThe Court held that this presumption infringed the right of an accused person to be presumed\ninnocent in terms of s 25(3)(c) of the Constitution. The court considered next whether the\npresumption was a reasonable and justifiable limitation of the right of an accused to be\npresumed innocent. It noted the high levels of crime in South Africa were linked to the\nproliferation of illegal firearms and ammunition and also acknowledged the difficulties\nconfronting the police in the investigation of crime and the illegal distribution and possession\nof arms and ammunition.\nThe Court found that the presumption was widely phrased and included within its reach many\ncategories of potentially innocent people who may have had no connection with the arms or\nammunition found, but against whom the presumption could be used to prove guilt despite\nthe existence of a reasonable doubt. It held that the presumption as it stood could not be\nclassified a reasonable and justifiable limitation on the right of an accused to be presumed\ninnocent.\nThe judgment of the Court was delivered by Langa J and was concurred in by the other\nmembers of the Court.\n\n1\n\n\f"}, "judgement_document": {"filename": "1.pdf", "file_url": "http://www.saflii.org/za/cases/ZACC/1996/1.pdf", "file_content": "IN THE CONSTITUTIONAL COURT OF SOUTH AFRICA\n\nCASE NO CCT 19/95\nIn the matter between:\nThe STATE\nand\nWELLINGTON MBATHA\n\nand\nCASE NO. CCT 35/95\nIn the matter between:\nThe STATE\nand\nNICOLAAS MARTHINUS PRINSLOO\nHeard on:\n\n16 NOVEMBER 1995\n\nDelivered on: 9 FEBRUARY 1996\nJUDGMENT\n\nLANGA J:\n[1]\n\nTwo matters come to this Court by way of referrals from the Witwatersrand Local\nDivision of the Supreme Court. The accused in the first case is Wellington\nMbatha who was tried and convicted in the Regional Court at Germiston.\nNicolaas Marthinus Prinsloo, an accused in the second matter, is standing trial in\n\n\f2\nthe Witwatersrand Local Division with 25 others in the case of the S v Le Roux\nand Others. I shall refer to the two accused persons as the applicants.\n[2]\n\nIn the first matter, the applicant appealed against his conviction on two counts\nunder the provisions of the Arms and Ammunition Act 75 of 1969 (the Act). The\ncharge concerned the unlawful possession of two AK47 rifles and twelve rounds\nof ammunition, in contravention of sections 32(1)(a) and 32(1)(e) of the Act\nrespectively. The sentences imposed, of eight and two years= imprisonment\nrespectively, were ordered to run concurrently. On appeal, the matter was in turn\nreferred to this Court by Leveson J, with MacArthur J agreeing, for a decision on\nthe constitutionality of the presumption contained in section 40(1) of the Act.\n\n[3]\n\nThe twenty-six (26) accused in the second matter were indicted on various\ncharges, 96 counts in all, arising out of a series of bomb explosions which took\nplace before the national elections in April 1994. After the close of the\nprosecution case, Flemming DJP refused an application for the discharge of all\nthe accused on all counts. The applicant and six others were acquitted on all but\nfour of the counts, namely, counts 80 to 83, which relate to the unlawful\npossession of machine guns, firearms and ammunition, in contravention\nrespectively of sections 32(1)(a) and 32(1)(e) of the Act. In refusing to discharge\nthe applicant on those remaining counts, the trial Judge stated that he relied\nsolely on the presumption in section 40(1) of the Act. He then suspended the\nproceedings and made the referral order in terms of section 102(1) of the\nConstitution of the Republic of South Africa Act 200 of 1993 (the Constitution) on\nthe basis that it was in the interests of justice that the issue be resolved at this\nstage of the proceedings. The case has been postponed to 16 February 1996.\n\n[4]\n\nThe issue in both matters is the validity of the presumption contained in section\n40(1) of the Act in the light of the provisions of section 25(3)(c) and (d) of the\nConstitution. The applicants complain that the presumption offends against the\n>fair trial= provisions in the Constitution, in particular, the right to be presumed\n\n\f3\ninnocent and the privilege against self-incrimination. Section 40(1) of the Act\nprovides:\nWhenever in any prosecution for being in possession of any article\ncontrary to the provisions of this Act, it is proved that such article\nhas at any time been on or in any premises, including any building,\ndwelling, flat, room, office, shop, structure, vessel, aircraft or\nvehicle or any part thereof, any person who at that time was on or\nin or in charge of or present at or occupying such premises, shall\nbe presumed to have been in possession of that article at that\ntime, until the contrary is proved.\n[5]\n\nThe first comprehensive statute to regulate arms and ammunition nationally was\nthe Arms and Ammunition Act 28 of 1937. Prior to this, each of the four provinces\nhad their own acts regulating the possession and distribution of arms and\nammunition. Section 32 of the 1937 Act provided:\nAny occupier of premises and any person who is upon or in charge\nof or who accompanies any vehicle, vessel or animal upon which\nor in which there is any article mentioned in section one or any arm\nor ammunition shall, until the contrary is proved, be deemed for the\npurposes of this Act to be the possessor of such article or arm as\nthe case may be.\nThe Orange Free State (Act 23 of 1908) and Transvaal (Act 10 of 1907) had\nsubstantially similar provisions. Our courts, in an attempt to avoid obviously\nunintended results, interpreted the word Aoccupier@ in the 1937 Act strictly. Thus\nin S v Mnguni 1962(3) SA 662 (NPD) at 664D-E, the word was held to mean the\nperson Awho is responsible for the premises and has the general control of\nthem.@ It was held further that the word did not mean Aany person who is an\noccupant of premises@ because it was Aunlikely that the legislature would have\ndeemed every person residing on the premises to be the possessor of arms.@\nSection 40(1) of the present Act came into operation on 1 February 1972. The\nterms of the presumption are clearly wider in scope than those in the antecedent\nlegislation, and now include not only occupants of premises but also persons\nAon@, Ain@ or Apresent at@ such premises at any time when the Aarticle@ has been\nAon@ or Ain@ such premises.\n\n\f4\n[6]\n\nAspects of section 25(3)(c) and (d) of the Constitution have already been the\nsubject of enquiry in some of the matters before this Court in which their impact\non statutory presumptions in our criminal law was considered. The relevant part\nof the section reads:\nEvery accused person shall have the right to a fair trial, which shall\ninclude the right .....\n(c)\nto be presumed innocent and to remain silent during plea\nproceedings or trial and not to testify during trial;\n(d)\nto adduce and challenge evidence, and not to be a\ncompellable witness against himself or herself ...\n\n[7]\n\nIn S v Zuma and Others 1995(2) SA 642(CC); 1995(4) BCLR 401(CC), the issue\nwas the constitutionality of a legal provision contained in section 217(1)(b)(ii) of\nthe Criminal Procedure Act 51 of 1977 which placed a burden on the accused to\nrebut a presumed fact, namely, that a confession had been made freely and\nvoluntarily. The phrase Aunless the contrary is proved@ which was used in the\nprovision meant, in effect, that if the accused failed to discharge the burden of\nproof, that is, on a balance of probabilities, the confession would be admitted\nnotwithstanding the existence of a reasonable doubt that it had been made freely\nand voluntarily. (See Ex Parte Minister of Justice: In re: R v Jacobson and Levy\n1931 AD 466 at 471; Ex parte Minister of Justice: In re: R v Bolon 1941 AD 345\nat 360 - 361; S v Mphahlele and Another 1982 (4) SA 505 (A) at 512C). Sections\n25(2) and 25(3)(c) and (d) of the Constitution entrench as a fundamental\nconstitutional value the fact that it is the duty of the prosecution to prove the guilt\nof an accused person in a criminal case. As Kentridge AJ at paragraph 25\npointed out, Athe presumption of innocence is derived from the centuries-old\nprinciple of English law, forcefully restated by Viscount Sankey in his celebrated\nspeech in Woolmington v Director of Public Prosecutions (1935) AC 462 (HL) at\n481, that it is always for the prosecution to prove the guilt of the accused person,\nand that the proof must be proof beyond a reasonable doubt.@ The rights to be\npresumed innocent, to remain silent during trial and not to be a compellable\nwitness against oneself are entrenched in sections 25(3)(c) and (d).\nConstitutional recognition of these rights in criminal trials means that statutory\n\n\f5\nerosion of these rights and principles can no longer be accepted without question\nas they were before this Constitution came into force; statutory presumptions and\nother legislation which adversely affect the rights entrenched in Chapter 3 of the\nConstitution will now have to meet the limitations criteria of section 33(1) of the\nConstitution. (See S v Makwanyane and Another 1995(3) SA 391 (CC);1995(6)\nBCLR 665 (CC) at paragraphs 100 and 156; S v Williams and Others 1995(3)\nSA 632 (CC); 1995(7) BCLR 861 (CC) at paragraphs 8 and 54; S v Bhulwana; S\nv Gwadiso 1996(1) SALR 388 (CC); 1995(12) BCLR 1579 (CC) at paragraph 16.)\nThis Court held in Zuma=s case that the presumption of innocence was infringed\nby the provision which imposed an onus on the accused to disprove the\nvoluntariness of the confession.\n[8]\n\nIn S v Bhulwana; S v Gwadiso supra this Court was concerned with a provision in\nSection 21(1)(a)(i) of the Drugs and Drug Trafficking Act 140 of 1992 which\nrequired that an accused who was proved to be in unlawful possession of dagga\nin excess of 115 grams be presumed, Auntil the contrary is proved,@ to be dealing\nin such dagga. The effect of the presumption was that if the accused failed to\nprove on a preponderance of probabilities that he or she was not dealing or\ntrafficking in dagga, a conviction for dealing would result, even if the evidence\nraised a reasonable doubt as to the innocence of such accused. O=Regan J\n(paragraph 15) pointed out on behalf of a unanimous court that the presumption\nof innocence was not new to our legal system but was in fact an established\nprinciple of our law. She referred, inter alia, to the general rule restated by the\nAppellate Division in R v Ndhlovu 1945 AD 369 at 386 that A[i]n all criminal cases\nit is for the Crown to establish the guilt of the accused, not for the accused to\nestablish his innocence. The onus is on the Crown to prove all averments to\nestablish his guilt.@ The only common law exception recognised was a defence of\ninsanity which had to be proved by the accused.\n\n[9]\n\nIt is now well established that the enquiry into the constitutionality of the\nimpugned section involves two stages. Firstly, whether the section is inconsistent\nwith a fundamental right contained in Chapter 3 of the Constitution; if it is, then\n\n\f6\nsecondly, whether the inconsistency is saved in terms of section 33(1) of the\nConstitution. In argument before us, the State was unable to indicate any reason\nfor departing from the principles expressed in the first stage of the enquiry in S v\nZuma. It was common cause that the provision amounts to a legal presumption;\nit is a reverse onus provision. As a presumption, it has similar features to that\ndiscussed in Bhulwana=s case. The effect of the provision is to relieve the\nprosecution of the burden of proof with regard to an essential element of the\noffence. It requires that the presumed fact must be disproved by the accused on\na balance of probabilities. (See R v Bolon supra at 360-1; S v Nene and Others\n(2) 1979(2) SA 521(D) at 523H; S v Mkanzi en >n Ander 1979(2) SA 757(T) at\n758H; S v Mphahlele supra 512B; S v Zuma supra at paragraph 4). As pointed\nout by O=Regan J in Bhulwana=s case (paragraph 15), a presumption of this\nnature is in breach of the presumption of innocence since it could result in the\nconviction of an accused person despite the existence of a reasonable doubt as\nto his or her guilt.\n[10]\n\nNo legal system can guarantee that no innocent person can ever be convicted.\nIndeed, the provision of corrective action by way of appeal and review\nprocedures is an acknowledgement of the ever-present possibility of judicial\nfallibility. Yet it is one thing for the law to acknowledge the possibility of wrongly\nbut honestly convicting the innocent and then provide appropriate measures to\nreduce the possibility of this happening as far as is practicable; it is another for\nthe law itself to heighten the possibility of a miscarriage of justice by compelling\nthe trial court to convict where it entertains real doubts as to culpability and then\nto prevent the reviewing court from altering the conviction even if it shares in the\ndoubts.\n\n[11]\n\nCounsel for the applicants also argued that the presumption violated the privilege\nor rule against self-incrimination. This was disputed by the State on the basis\nthat the accused was not compelled to give evidence, self-incriminatory or\notherwise. The Constitution does not mention a right or privilege against selfincrimination expressly, but the cluster of >fair trial= rights guaranteed in section\n\n\f7\n25(3)(c) and (d) of the Constitution includes the right of the accused Ato remain\nsilent during plea proceedings or trial and not to testify during trial ... [and] ... not\nto be a compellable witness against himself or herself.@ In Ferreira and Others v\nLevin and Others CCT/5/95 (judgment delivered on 6 December 1995), this\nCourt (per Ackermann J at paragraph 79 and Chaskalson P at paragraph 159)\nheld that a right against self-incrimination is implicit in the provisions of section\n25(3) of the Constitution. However, because of the view I take with regard to the\ndecisiveness of the presumption of innocence for this enquiry, it is unnecessary,\nfor purposes of this judgment, to canvass the precise scope of such right or\nprivilege or its applicability to the facts of the present case.\n[12]\n\nThe conclusion I come to, therefore, is that section 40(1) of the Act offends\nagainst the right of an accused person to be presumed innocent, in terms of\nsection 25(3)(c) of the Constitution. The provision can accordingly only be\npermissible if it is saved by the provisions of section 33(1) of the Constitution.\n\n[13]\n\nSection 33(1) of the Constitution, in so far as it applies to section 25(3), provides\nas follows:\nThe rights entrenched in this Chapter may be limited by law of\ngeneral application, provided that such limitation (a) shall be permissible only to the extent that it is (i) reasonable; and\n(ii)justifiable in an open and democratic society\nbased on freedom and equality; and\n(b) shall not negate the essential content of\nthe right in question,\nand ... shall ... also be necessary.\n\n[14]\n\nIn S v Makwanyane supra, Chaskalson P (at paragraph 104) stated that the\nenquiry involves the weighing up of competing values and ultimately an\nassessment based on proportionality. He named the factors to be considered in\nthis process as including: the wider implications which the right has for our\nsociety (>an open and democratic society based on freedom and equality=); the\npurpose for which the right is limited; the importance of that purpose to our\nsociety; the extent of the limitation and its efficacy and, in cases where the\nlimitation has to be necessary, whether the objectives of the limitation could\nreasonably be achieved by means less damaging to the right.\n\n\f8\n[15]\n\nThe State argued that the inroads which section 40(1) of the Act makes on the\npresumption of innocence are reasonable, justifiable and necessary and that\nthey do not negate the essential content of the right. Relying on remarks in S v\nZuma supra (at paragraph 41), it was argued that the reverse onus provisions in\nthe present case are justifiable and therefore constitutionally permissible. In the\npassage referred to, Kentridge AJ pointed out that the effect of the judgment in\nthat case was not to invalidate every legal presumption reversing the onus of\nproof as some presumptions Amay be justifiable as being rational in themselves,\nrequiring an accused person to prove only facts to which he or she has easy\naccess, and which it would be unreasonable to expect the prosecution to\ndisprove ... Or there may be presumptions which are necessary if certain\noffences are to be effectively prosecuted, and the State is able to show that for\ngood reason it cannot be expected to produce the evidence itself ...@ The State\ncontended that circumstances existed which rendered section 40(1) of the Act\njustifiable, regard being had to the context and the manner in which its provisions\nwere implemented.\n\n[16]\n\nThe State characterised the objective of the presumption in the present case as\nbeing to assist in combating the escalating levels of crime as part of the\ngovernment=s duty to protect society generally. The contention was that the\nprovision is intended to ensure effective policing and to facilitate the investigation\nand prosecution of crime as well as to ease the prosecution=s task of securing\nconvictions for contraventions under the Act. Such an objective is truly laudable\nand its importance, in the current climate of very high levels of violent crime,\ncannot be overstated. Information in papers submitted to us reveals that during\nthe period 1990 to 1994, there was a distressing increase in crimes of violence.\nThe common denominator in most of them is the involvement of firearms. In a\ndiscussion document titled: Recent Crime Trends, Dr Lorraine Glanz of the\nHuman Sciences Research Council observed that Athe face of crime is becoming\nincreasingly violent and more serious,@ and that the rampant crime levels must\nhave Aa profound negative effect on the quality of life in communities. If left\nunchecked, a protracted increase in violent crime in particular is a threat to social\nstability.@ I could not agree more. A further ugly feature allied to the actual deeds\n\n\f9\nof violence is the incidence of illegal smuggling, sale and possession of arms.\nWe were told that trafficking in arms and drugs from neighbouring countries into\nSouth Africa is taking place on a significant scale. There is a proliferation of\nillegal firearms throughout the country and this, no doubt, contributes in no small\nmeasure to the high incidence of violent crime. This state of affairs is obviously a\nmatter of serious concern, not only for the courts, but for the legislature, the\npolice and the entire population which is affected by it. There is no doubt that,\nwhatever the causes, crimes of violence particularly those involving firearms\nhave reached an intolerably high level and that urgent corrective measures are\nwarranted.\n[17]\n\nThe problems which the government has to contend with in fulfilling its duty to\nprotect society were given to us in some detail. We were informed that the\ndetection of people in possession of illegal arms and ammunition is often very\ndifficult. Police have to depend on informers or pure chance to trace offenders.\nThe use of informers who infiltrate gun-smuggling networks is a helpful but often\ntime-consuming and dangerous process. Gunrunners make extensive use of\ncouriers to transport arms; some of the couriers, especially women and children,\nare used without their knowledge. Even vehicles such as ambulances and official\ngovernment cars are sometimes used, without the people in control of the\nvehicles knowing it. Sometimes aircraft and motor vehicles equipped with false\npanels and compartments for storage are used in the illegal transportation of\narms. The problem of policing is compounded by geographical factors; the\nborders of South Africa are extensive and impossible to patrol effectively 24\nhours a day, making it easier for cross-border dealers and smugglers of arms to\nply their trade and evade detection. The severe shortage of trained personnel\nhas adverse effects on the capacity of the police to conduct raids and searches\nin places like hostels and informal settlements, to look for places used for\nconcealment of illegal arms and to trap motor vehicles used in illegal conveyance\nof arms. Ordinary members of the community often withhold information because\nthey are too terrified and intimidated by armed gangsters and traffickers in\nnarcotic drugs and illegal arms.\n\n\f10\n\n[18]\n\nIt is difficult not to have sympathy for representations of this nature, coming as\nthey do from officials of the State whose task it is to deal with what has become a\ntruly serious problem. These are real and pressing social concerns and it is\nimperative that proper attention should be given to finding urgent and effective\nsolutions. The issue before us, however, is not simply whether there is a\npressing social need to combat the crimes of violence - there clearly is - but also\nwhether the instrument to be used in meeting this need is itself fashioned in\naccordance with specifications permitted by the Constitution. Although the\nrelevant legislative provision was enacted before the Constitution came into\nforce, the enquiry is whether the limitation it imposes on constitutionally protected\nrights is consistent with the provisions of the Constitution. This involves a\nconsideration of the other factors referred to in Makwanyane=s case, and in\nparticular, the importance of the impugned right in an open and democratic\nsociety, and the extent to which that right has been limited. As O=Regan J said in\nS v Bhulwana supra (at paragraph 18), Athe more substantial the inroad into\nfundamental rights, the more persuasive the ground of justification must be.@\n\n[19]\n\nThe presumption of innocence is clearly of vital importance in the establishment\nand maintenance of an open and democratic society based on freedom and\nequality. If, in particular cases, what is effectively a presumption of guilt is to be\nsubstituted for the presumption of innocence, the justification for doing so must\nbe established clearly and convincingly.\n\n[20]\n\nIt was argued that without the presumption it would be almost impossible for the\nprosecution to prove both the mental and physical elements of possession. I do\nnot agree. The circumstances of each case will determine whether or not the\nelements of possession have been established beyond reasonable doubt. The\nevidence need not necessarily be direct. It may be, and often is, circumstantial\nand will often be sufficient to secure a conviction without the assistance of the\npresumption. There will no doubt be cases in which it will be difficult to prove\nthat a particular person against whom the presumption would have operated,\n\n\f11\nwas in fact in possession of the prohibited article. If that person was in fact\nguilty, the absence of the presumption might enable him or her to escape\nconviction. But this is inevitably a consequence of the presumption of innocence;\nthis must be weighed against the danger that innocent people may be convicted\nif the presumption were to apply. In that process the rights of innocent persons\nmust be given precedence. After all, the consequences of a wrong conviction\nare not trivial.\n\nApart from the social disapprobation attached to it, heavy\n\npenalties are attached to contraventions of the Act. In the cases before us, the\nsentence prescribed by the Act for the illegal possession of a firearm is\nimprisonment for a period not exceeding 25 years with a minimum of five years.\nIllegal possession of ammunition attracts a sentence of imprisonment for a period\nnot exceeding 25 years.\n[21]\n\nThe presumption is couched in wide terms and no attempt has been made to\ntune its provisions finely so as to make them consistent with the Constitution and\nto avoid the real risk of convicting innocent persons, who happen to be in the\nwrong place at the wrong time. It may be invoked in a wide range of\ncircumstances and against any number of categories of persons, as long as they\nhave been in, on or at a particular place at the relevant time. The presumption\nbecomes operative without the prosecution being required to show any\nconnection between the accused and the prohibited article, and between such\naccused and the place where the article was. APremises@ is defined in the section\nas including Aany building, dwelling, flat, room, office, shop, structure, vessel,\naircraft or vehicle or any part thereof@. The provision targets Aany person@ who\nwas in, on or at the premises at the relevant time, regardless of that person=s\npossible connection (or lack of it) with such premises. It also targets any person\nin charge of or occupying the premises, however remote his or her connection\nwith the particular part thereof where the offending article is proved to have been.\nIndeed, it very much looks as if the intention was to override the restrictions read\ninto that section=s forerunner in cases like S v Mnguni supra.\n\n[22]\n\nThe application of the presumption does not depend on there being a logical or\n\n\f12\nrational connection between the presumed fact and the basic facts proved, nor\ncan it be claimed that in all cases covered by the presumption, the presumed fact\nis something which is more likely than not to arise from the basic facts proved.\nThe mere presence of the accused in, on or at the premises at the same time as\nthe prohibited article does not, as a matter of course, give rise to the inference of\npossession. There are clearly circumstances where this connection can be\nreasonably sustained. Circumstances may even arise where such an adverse\ninference would be warranted without the accused having been present in, on or\nat the particular premises when the firearm was found. An example is a case\nwhere it is proved beyond a reasonable doubt that a firemarm was found in the\nglove compartment of a locked car which had been driven by its owner and in\nwhich there had been no passengers. If the accused=s exculpatory version is\nfound to be false (also beyond a reasonable doubt), the conviction would be\ndefensible. That would be so, not because of the presumption created by\nsection 40(1) of the Act, but as a matter of logical inference. The problem with\nthe provision is that it contains no inherent mechanism to exclude those who are\ninnocent and who would otherwise be included within its reach. If, for example, a\nsingle firearm were to be found on a crowded bus, each passenger on the bus\nwould be liable to be arrested and prosecuted, and would be presumed guilty\nunless he or she were able to establish innocence.\n[23]\n\nCounsel for the State claimed that in practice, use of the presumption does not\nlead to absurd results because it is applied with circumspection by prosecutors.\nThe contention is not convincing for a number of reasons. First, there is nothing\nto suggest that prosecutors in general and around the country agree with the\nview or, if they do, that it is invariably implemented. If a general directive to that\neffect has been issued, it has not been mentioned in argument. In the second\ninstance, even if one were to accept that prosecutors adhere to such a policy\nthere is no evidence that the police do so. On the contrary, counsel for the State\nsubmitted that the breadth of the presumption was a valuable investigative tool\nbecause it enabled the police to detain anyone found in the vicinity of an\nunlicensed firearm for questioning. Quite apart from the fact that the legality of\n\n\f13\ndetention for questioning may be suspect, and its constitutionality the more so,\nthe submission underscores the fact that the very breadth of the presumption is\nregarded by the police as warranting the blanket arrest of groups of persons\nwithout any suspicion that each of them has committed any offence. In S v\nShange and Others 1994(1) SACR 621(N), for instance, the police actually\narrested and charged the eight appellants who were passengers in a vehicle\nfrom which a firearm and ammunition were thrown out as it approached a police\nroadblock. The prosecution proceeded against them and they were all convicted,\non the basis of the presumption, notwithstanding the fact that each one of them\ngave evidence denying any knowledge of the articles in question. Apart from\nhaving been attending the same tribal celebration at a certain kraal and the fact\nthat they had all spontaneously clambered on to the vehicle simply because it\nwas going in their direction, there was nothing connecting them with each other,\nnor was there any evidence of any link between each one of them and the\narticles concerned. It was only when the appeal was heard by the Provincial\nDivision that the convictions were reversed on the basis that the appellants had,\nin fact, discharged the onus cast on them by virtue of the presumption. One can\nreadily accept that police conducting a raid of a hostel are in a quandary when\nthey find a firearm in a place with no apparent link with any of the hosteldwellers; or as the State suggested in argument, when a firearm was found in a\nvehicle wreck in the courtyard. One must also accept, as has been done in\nparagraphs 16 to 18 above, that the eradication of the cancer of illegal firearms is\na pressing public concern calling for vigorous and concerted effort. Nevertheless\nsuch concern cannot render the wholesale arrest of ostensibly innocent people\neither reasonable or justifiable in an open and democratic society based on\nfreedom and equality. Thirdly, and in itself conclusively, it is clear that the\npresumption could lead to the conviction of innocent persons. Their rights are\nenshrined in the Constitution and do not depend on the discretion of the police or\nthe attorney-general to prosecute only in cases where the accused are in fact\nguilty. If the police and the attorney-general are satisfied of the guilt of the\naccused, they should be able to establish this in the ordinary way.\n\n\f14\n[24]\n\nIf the purpose of the provision is to promote the legitimate law enforcement\nobjective of separating innocent bystanders from genuine suspects, then it\nshould be cast in terms limited to serving that function only. A legislative\nlimitation motivated by strong societal need should not be disproportionate in its\nimpact to the purpose for which that right is limited. If restrictions are warranted\nby such societal need, they should be properly focused and appropriately\nbalanced. The foundations of effective law enforcement procedures should\nalways be the thorough collection of evidence and the careful presentation of a\nprosecution case. The sweeping terms of the presumption, however, encourage\ndragnet searches followed by dragnet prosecutions in which innocent\nbystanders, occupants and travellers can be required to prove their innocence\nand the normal checks and balances operating at the pre-trial stage cease to\noperate. Immense discretionary power is given to the police, in the first instance\nand to the prosecuting authorities thereafter, as to whether or not to proceed with\narrest and indictment. From a practical point of view, the focus of crucial\ndecision-making on guilt or innocence thus shifts from the constitutionally\ncontrolled context of a trial to the unrestrained discretion of police and\nprosecutor. The possibility cannot be excluded that overworked police and\nprosecuting authorities would understandably be tempted to focus on merely\ngetting sufficient evidence to raise the presumption of possession; they can then\nrely on a poor showing by the accused in the witness box to secure a conviction.\nYet the law gives no guidance to investigators and prosecutors as to when it is\nappropriate to rely on the presumption to proceed with a case and when not.\nInnocent persons may be put to the inconvenience, indignity and expense of a\ntrial simply because they were in a bus, on a ship, or in a taxi, restaurant or\nhouse where weapons happened to be discovered. At the same time, the\nobjectivity and professionalism of the police and prosecution are undermined by\nthe lack of principled criteria governing their actions. In my view, in order to\ncatch offenders and secure their convictions, it is not reasonable and justifiable\neither to expose honest citizens to such open-ended jeopardy or to impose such\nill-defined responsibility upon those charged with law enforcement.\n\n\f15\n[25]\n\nThe presumption is not only too wide in its application with regard to persons, it\nalso casts a heavy burden on those who are caught by it to disprove guilt. The\nfacts in the case of S v Mtshemla and Others 1994(1) SACR 518 (A) give some\nindication of the seriousness of the task facing an accused person if he or she is\nto discharge the burden of proof. Of the three persons accused of possession of\none firearm, in that matter, two elected to give evidence to rebut the\npresumption. They were both convicted, the magistrate ruling that their evidence\nwas insufficient to dislodge the presumption. The third, who had decided to\nremain silent was also convicted, there being nothing in his case to gainsay the\npresumption. In another case, that of S v Makunga and Others 1977(1) SA 685\nAD, the remarks of Wessels JA (at 699A) are illustrative of some of the problems\ninherent in the practical application of the presumption:\n... [T]here was an onus on each one of the seven accused to\nestablish by a preponderance of probabilities that he was not in\npossession of any one of the six firearms found in the hut. In my\nopinion, no one of the accused succeeded in discharging that\nonus. The mere fact that on the evidence it was probable that one\nunidentified accused was in possession of the toy pistol is wholly\ninsufficient to discharge the onus which rested on each one of the\nseven accused.\n\n[26]\n\nBased on the assessment of the potential effect of the provision on innocent\npeople, I am not persuaded that the presumption, as it stands, satisfies the\nrequirements of reasonableness and justifiability. I am fortified in this conclusion\nby the fact that it has also not been demonstrated that its objective, that is,\nfacilitating the conviction of offenders, could not reasonably have been achieved\nby other means less damaging to constitutionally entrenched rights. Although\nthe choice of the appropriate measures to address the need is that of the\nlegislature, it has not been shown that an evidentiary burden, for example, would\nnot be as effective. I should not be understood as suggesting that any provision\nimposing an evidentiary burden, particularly if it is framed as broadly as the\npresumption in the present case, would be immune from constitutional attack.\nBut by requiring the accused to provide evidence sufficient to raise a reasonable\n\n\f16\ndoubt, such a provision would be of assistance to the prosecution whilst at the\nsame time being less invasive of section 25(3) rights. That it might impact on the\nright of an accused person to remain silent is true; but on the assumption that the\nrampant criminal abuse of lethal weapons in many parts of our country would\njustify some measured re-thinking about time-honoured rules and procedures,\nsome limitation on the right to silence might be more defensible than the present\none on the presumption of innocence. The accused could of course be exposed\nto the risk of being convicted if he or she fails to offer an explanation which could\nreasonably possibly be true, regarding physical association with the weapons;\nthere would however be no legal presumption overriding any doubts that the\ncourt might have. At the end of the day and taking into account all the evidence,\nthe court would still have to be convinced beyond a reasonable doubt that the\naccused was indeed guilty.\n[27]\n\nI accordingly find that although the provision in question is a law of general\napplication, it has not been shown to be reasonable as required by section 33(1)\nof the Constitution. It is furthermore so inconsistent with the values which\nunderlie an open and democratic society based on freedom and equality that it\ncannot be said to be justifiable. In view of this finding, it is not necessary to\ncanvass the question whether the essential content of the right is negated, nor\nwhether the limiting provision is necessary within the meaning of section 33(1) of\nthe Constitution. Section 40(1) of the Act is unconstitutional inasmuch as it is an\nunreasonable and unjustifiable violation of the presumption of innocence.\n\n[28]\n\nDuring argument, some time was devoted to a question that keeps cropping up\nin matters before us and that is the problem of improper referrals. This Court has\nexpressed itself on a number of occasions on the correctness or otherwise of\nreferrals made under section 102(1) of the Constitution. Some of the remarks\nneed to be repeated. In Zuma=s case at paragraph 10, Kentridge AJ points out\nthat A[e]ven if a rapid resort to this Court were convenient, that would not relieve\nthe Judge from making his own decision on a constitutional issue within his\njurisdiction.@ In S v Mhlungu and Others 1995(3) SA 867 (CC); 1995(7) BCLR\n\n\f17\n793(CC) at paragraph 59, Kentridge AJ cautioned against premature referrals to\nthis Court and observed:\nThe fact that an issue within the exclusive jurisdiction of this\ncourt arises in a provincial or local division does not\nnecessitate an immediate referral to this court. Even if the\nissue appears to be a substantial one, the court hearing the\ncase is required to refer it only\n(i)\n(ii)\n\nif the issue is one which may be decisive for the case; and\nif it considers it to be in the interest of justice to do so ...\n\n... I would lay it down as a general principle that where it is\npossible to decide any case, civil or criminal, without reaching a\nconstitutional issue, that is the course which should be followed.\n[29]\n\nIt is by no means clear whether or not the conviction of Mbatha was on the basis\nof the presumption in section 40(1) of the Act; nor is it clear that this is a matter\nwhich could not have been disposed of without reaching the constitutional issue.\nThe referral was therefore not a proper one. During argument, counsel for this\napplicant made an oral request from the bar for Adirect access@ in terms of Rule\n17 of the Rules of this Court, read with section 100(2) of the Constitution. The\napplication was not opposed. ADirect access@ provisions have received their fair\nshare of attention in this Court. As stated in Zuma=s case at paragraph 11, what\nis contemplated is that direct access should be allowed Ain only the most\nexceptional cases, and it is certainly not intended to be used to legitimate an\nincompetent reference.@ In terms of Rule 17(1), the special circumstances\nenvisaged Awill ordinarily exist only where the matter is of such urgency, or\notherwise of such public importance, that the delay necessitated by the use of\nthe ordinary procedures would prejudice the public interest or prejudice the ends\nof justice and good government.@ Clarity with regard to the presumption is of\nimmense public importance. There are any number of trials either pending or\nproceeding, in which the presumption is liable to be invoked.\n\nIt is therefore\n\nnecessary that legal certainty should be achieved as soon as possible. I am\naccordingly of the view that this is a matter in which direct access should be\ngranted. Because Prinsloo's case was concerned with an identical issue, the\ntwo matters were set down for one date.\n\nBoth sets of counsel prepared\n\n\f18\nexhaustive and very helpful argument and the two matters were argued together\nbefore us. The issue in Prinsloo=s case is clearly decisive for the case with regard\nto some of the accused. Flemming DJP considered it to be in the interests of\njustice for the issue to be referred and cogent reasons have been furnished to\nsupport the referral. The issue in Prinsloo=s case was, in the circumstances,\nproperly before this Court.\n[30]\n\nI now turn to consider the appropriate order. Section 98(5) of the Constitution\nempowers this Court to suspend a declaration of invalidity Ain the interests of\njustice and good government@ until Parliament corrects the defect in the\nlegislation concerned. The effect of such a suspension would be to prolong the\nrisk inherent in a reverse onus provision until the legislature intervenes. What this\namounts to is that an unsatisfactory state of affairs, where accused persons\ncould be convicted despite the existence of a reasonable doubt, would be\nallowed to continue until new legislation is enacted to deal with the issue. There\nis no knowing when this legislative intervention might come. On the other hand,\nshould the declaration of invalidity operate with immediate effect, the prosecution\nwould be able to deal with contraventions of the Act in the normal manner, as in\nall other prosecutions where there is no reliance on a presumption. There do not\nappear to be any compelling considerations of Ajustice and good government@\nrequiring that the infringement of this constitutionally protected right should\ncontinue beyond the date of this order. On the contrary, it would be undesirable\nfor the courts to continue applying a provision which is not only manifestly\nunconstitutional, but which also results in grave consequences for potentially\ninnocent persons in view of the serious penalties prescribed.\n\n[31]\n\nSection 98(6)(a) of the Constitution prescribes that unless this Court orders\notherwise, in the interests of justice and good government, the order of invalidity\nshall not invalidate anything done or permitted in terms of the unconstitutional\nprovision. In Mbatha=s case, the matter is on appeal to the Witwatersrand Local\nDivision and that court will be able to take this judgment and order into account\nwhen it proceeds with the matter. In Prinsloo=s case, the trial is still in progress\n\n\f19\nand giving effect to the order should present no problems. The order made\nshould, however, be operative in the cases of any other litigants who might be\nsimilarly placed. The general considerations set out above were present in\nBhulwana=s case supra and I see no reason to depart from the approach adopted\nby this Court in that matter. The order that I propose to make will protect not only\nthe rights of accused persons in pending cases (S v Mhlungu supra at paragraph\n48), but also the rights of the persons referred to in paragraph two of the Order.\n[32]\n\nFlemming DJP has pointed out that a declaration of invalidity by this Court would\nnot, in itself, entitle the trial Judge to immediately discharge those accused who\nwould have been acquitted at the end of the case for the prosecution but for the\noperation of the presumption. His view is that he is functus officio and cannot\nrecall his judgment; consequently, the applicant Prinsloo and the relevant coaccused would be forced to endure the unsatisfactory prospect of continuing to\nbe part of the trial which still has a long way to go before conclusion. The Judge\ntherefore proposed that if the presumption were found to be unconstitutional, this\nCourt should make an appropriate order to enable the trial court to end the\nproceedings against those who should have been discharged. I express no\nopinion on whether or not the trial Judge is functus officio as regards the\nparticular issue. This is a matter entirely within his jurisdiction which he must\ndetermine on a proper construction of the relevant provisions. It was not argued\nbefore us that we had the jurisdiction to set aside the judgment of the trial court\nrefusing to discharge Prinsloo. The Attorney-General of the Transvaal, however,\ngave a firm undertaking during argument that should the presumption be\ndeclared unconstitutional he would stop the prosecution against the relevant\naccused. It therefore becomes unnecessary to take this matter any further.\n\n[33]\n\nFinally, I wish to express the Court's appreciation to Mr M R Hellens SC and Mr\nP R Jammy who assisted him for preparing and presenting argument on behalf\nof the applicant in the first case at the request of the Court.\n\n\f20\n\n[34]\n\nThe following order is accordingly made:\n1.\n\nSection 40(1) of the Arms and Ammunition Act 75 of 1969 is inconsistent\n\nwith the Republic of South Africa Constitution Act 200 of 1993 and is, with effect\nfrom the date of this judgment, invalid and of no force or effect.\n2.\n\nIn terms of section 98(6) of the Constitution, this declaration of invalidity\n\nshall invalidate any application of section 40(1) of the Arms and Ammunition Act\n75 of 1969 in any criminal trial in which the verdict of the trial court was or will be\nentered after the Constitution came into force, and in which, as at the date of this\njudgment, either an appeal or review is pending or the time for noting such\nappeal has not yet expired.\n3.\n\nThe matters of S v Mbatha and S v Prinsloo are referred back to the\n\nWitwatersrand Local Division of the Supreme Court to be dealt with in\naccordance with this judgment.\n\nPN Langa, Judge of the Constitutional Court\nChaskalson P, Mahomed DP, Ackermann J, Didcott J, Kentridge AJ, Kriegler J, Madala\nJ, Mokgoro J, O=Regan J and Sachs J concur in the judgment of Langa J.\n\n\f21\nCASE NO:\n\nCCT 19/95\n\nCOUNSEL FOR APPLICANT:\n\nM R Hellens SC\nP R Jammy\nAt the request of the Court\n\nCOUNSEL FOR RESPONDENT:\n\nJ A van S D=Oliviera\nE Leonard\nE Erasmus\n\nCASE NO:\n\nCCT 35/95\n\nCOUNSEL FOR APPLICANT:\n\nL van der Walt\n\nINSTRUCTED BY:\n\nOdendal & Kruger, Delmas\n\nCOUNSEL FOR RESPONDENT:\n\nR J Chinner\nJ A L Pretorius\n\nDATE OF HEARING:\n\n16 November 1996\n\nDATE OF JUDGMENT:\n\n9 February 1996\n\n\f"}}]}