{"1995": [{"title": "S v Zuma and Others (CCT5/94) [1995] ZACC 1; 1995 (2) SA 642; 1995 (4) BCLR 401 (SA); 1995 (1) SACR 568; [1996] 2 CHRLD 244 (5 April 1995)", "url": "http://www.saflii.org/za/cases/ZACC/1995/1.html", "summary_document": {"filename": "1media.pdf", "file_url": "http://www.saflii.org/za/cases/ZACC/1995/1media.pdf", "file_content": " \n\n \n\nS v Zuma and others \n\nExplanatory Note  \n\n \n\n \n\n                                                                                                           Case CCT 5/94 \n\n \n \nThe following explanation is provided to assist the media in reporting this case and is not \nbinding on the Constitutional Court or any member of the Court. \n \n\nSection 217(1)(b)(ii) of the Criminal Procedure Act 51 of 1977 provides that where a \nconfession by an accused person has been made to a magistrate or has been confirmed and \nreduced to writing in the presence of a magistrate it shall be admissible in evidence against \nthe accused. The subparagraph further provides that the confession shall be presumed, unless \nthe contrary is proved, to have been freely and voluntarily made by the accused in his or her \nsound and sober senses and without having been unduly influenced to make the confession.  \n\nThe accused were indicted on two counts of murder and one of robbery. At their trial before \nHugo J in the Natal Provincial Division they pleaded not guilty. Two of the accused had \nmade statements before a magistrate which were tendered by the prosecution as admissible \nconfessions. The question arose whether s 217(1)(b)(ii) of the Criminal Procedure Act was \ninconsistent with the provisions of the Constitution. Counsel for the defence and the \nprosecution consented in terms of s 101(6) of the Constitution to the trial judge deciding the \nissue. Notwithstanding the consent, Hugo J refrained from deciding on the validity of the \nsection, referring the matter to the Constitutional Court for decision and adjourning the trial \nsine die. The Attorney-General of Natal sought direct access to the Constitutional Court in \nterms of s 100(2) of the Constitution on the grounds that it was in the interests of justice that \na binding decision be given as soon as possible on the validity of s 217(1)(b)(ii).  \n\nThe Court granted the application for direct access.  \n\nThe Court found s 217(1)(b)(ii) to be in violation of s 25(3) of the Constitution (right to a fair \ntrial). It held it to be a longstanding principle of English and South African law of evidence \nthat the prosecution should prove that any confession on which it wished to rely was freely \nand voluntarily made. Section 217(1)(b)(ii) of the Criminal Procedure Act places on the \naccused the burden of proving on a balance of probabilities that a confession recorded by a \nmagistrate was not free and voluntary. It is not sufficient for the accused merely to raise a \ndoubt. The section therefore creates a legal burden of rebuttal on the accused -- a so-called \n'reverse onus'.  \n\nThe Court considered the common law rule requiring the prosecution to prove that a \nconfession has been freely and voluntarily made to be inherent in the rights specifically \nmentioned in s 25(2), s 25(3)(c) and (d) of the Constitution and forms part of the right to a \nfair trial. These rights are the necessary reinforcement of the principle that the prosecution \nmust prove the guilt of the accused beyond reasonable doubt. Reversing the burden of proof \nseriously compromises and undermines these rights. It followed that s 217(1)(b)(ii) violates \nthese provisions.  \n\n1 \n\n\f \n\nThe Court held that the tests of reasonableness, justification and necessity for limitation of \nfundamental rights set out in s 33(1) of the Constitution are not identical, and in applying \neach of them individually one will not always get the same result. But in the present case, it \nwas held, reasonableness, justification and necessity may be looked at and assessed together. \nThe rights interfered with are fundamental to concepts of justice and forensic fairness and \nhave existed in South Africa for over 150 years. A drastic consequence of the alteration to the \nlaw brought about by s 217(1)(b)(ii) is the possibility that an accused may be convicted over \nthe reasonable doubt of the court. It was not shown by the state that it was impossible or \nunduly burdensome for the prosecution to discharge its onus under the common law rule. Nor \nwas it shown that the common law rule caused substantial harm to the administration of \njustice. Even if it were assumed that the reverse onus may in some cases obviate or shorten a \ntrial within a trial on the admissibility of a confession, and released the prosecution from the \ninconvenience of marshalling and calling their witnesses before the accused gave evidence, \nthese advantages do not outweigh and justify the substantial infringement of fundamental \nrights that are the result of the application of the subparagraph. Accordingly s 217(1)(b)(ii) \ndoes not meet the criteria laid down in s 33(1) of the Constitution. It is declared inconsistent \nwith the Constitution and invalid.  \n\nIn the absence of a specific order by the Constitutional Court in the interests of justice and \ngood government giving retrospective effect to a declaration that a law is invalid, s 98(6)(a) \nprovides that a declaration of invalidity shall not invalidate anything done or permitted in \nterms of that law before the coming into effect of the declaration of invalidity. The Court held \nthat the likely result of ordering the declaration of invalidity of s 217(1)(b)(ii) to have full \nretrospective effect, invalidating earlier rulings on admissibility, would be numerous appeals \nwith the possibility of proceedings de novo. In proceedings de novo the necessary evidence \nof voluntariness may no longer be available. The Court considered s 98(6)(a) to be intended \nto ensure that the invalidation of a law existing at the commencement of the Constitution \nshould not ordinarily have retrospective effect, so as to avoid the dislocation and \ninconvenience of undoing transactions, decisions or actions taken under that law. The \nConstitutional Court's power to order otherwise in the interests of justice and good \ngovernment should be exercised circumspectly. In some cases the interests of individuals \nmust be weighed against the interest of avoiding dislocation to the administration of justice \nand the desirability of a smooth transition from the old to the new. The application of the \nsubparagraph may well have caused injustice to accused persons, but the court cannot repair \nall past injustice by a simple stroke of the pen. In the present case, it was held, a proper \nbalance could be struck by invalidating the admission of any confession in reliance on s \n217(1)(b)(ii) of the Criminal Procedure Act before the date of the declaration of invalidity of \nthe section, but in respect only of trials begun on or after 27 April 1994 and in which the \nverdict had not been given at the date of the declaration.  \n\nThe judgment of the Court was delivered by Kentridge AJ and was concurred in by all the \nother members of the Court.  \n\n \n\n2 \n\n\f"}, "judgement_document": {"filename": "1.pdf", "file_url": "http://www.saflii.org/za/cases/ZACC/1995/1.pdf", "file_content": "IN THE CONSTITUTIONAL COURT OF SOUTH AFRICA\n\nIn the matter of :\n\nCASE NO : CCT/5/94\n\nZUMA AND TWO OTHERS\n\nApplicants\n\nand\n\nTHE STATE\n\nRespondent\n\nHEARD ON\n\n23 February 1995\n\nDELIVERED ON\n\n5 April 1995\n\nJUDGMENT\n\n[1] KENTRIDGE  AJ:    This  case  arises  from  a  criminal  trial\n\nbefore Hugo J in the Natal Provincial Division.  In this\n\n\f2\n\nCourt it was heard together with the case of Mhlungu and \n\nFour Others v The State (Case No CCT/25/94) which also arose from\n\na criminal trial in the Natal Provincial Division.  Each of them\n\nhas  come  to  this  Court  by  way  of  a  referral  by  the  judge\n\npresiding over the trial.  In each case the judge referred to\n\nthis  Court  for  decision  the  question  whether  section\n\n217(1)(b)(ii)  of  the  Criminal  Procedure  Act  No  51  of  1977  is\n\ninconsistent with the provisions of the Republic of South Africa\n\nConstitution, 1993.  If we so find it will be our duty under\n\nsection  98(5)  of  the  Constitution  to  declare  the  provision\n\ninvalid.  In the Mhlungu case the judge also referred to us the\n\nquestion  whether,  having  regard  to  section  241(8)  of  the\n\nConstitution,  the  provisions  of  Chapter  3  of  the  Constitution\n\napply  to  the  proceedings  before  him.    Section  241(8)  raises\n\nimportant  issues  which  do  not  directly  touch  the  Zuma  case.\n\nConsequently, we propose to give judgment at this stage only in\n\nthe Zuma case, and to deal with the Mhlungu case in due course\n\nin a separate judgment.\n\n[2] In this case (as in the Mhlungu case) this Court itself has\n\nraised the issue whether the referral was competent. It is\n\nnecessary to set out in some detail the circumstances of\n\nthe criminal trial which led to the referral to this Court.\n\nBefore doing so, however, I must outline the history and\n\neffect of the challenged sub-paragraph of section 217 of\n\n\fthe Criminal Procedure Act.\n\n3\n\n[3] The section deals with the admissibility in evidence of a\n\nconfession made by an accused person before trial.  Sub-\n\nsection (1) and proviso (a) thereto read as follows -\n\n\"(1)\n\nEvidence of any confession made by any person in relation to the\ncommission of any offence shall, if such confession is proved to\nhave been freely and voluntarily made by such person in his sound\nand  sober  senses  and  without  having  been  unduly  influenced\nthereto,  be  admissible  in  evidence  against  such  person  at\ncriminal proceedings relating to such offence :  \nProvided - \n\n(a)\n\nthat  a  confession  made  to  a  peace  officer,  other  than  a\nmagistrate or justice, or, in the case of a peace officer\nreferred to in section 334, a confession made to such peace\nofficer which relates to an offence with reference to which\nsuch  peace  officer  is  authorized  to  exercise  any  power\nconferred  upon  him  under  that  section,  shall  not  be\nadmissible  in  evidence  unless  confirmed  and  reduced  to\nwriting in the presence of a magistrate or justice;...\"\n\n \n\nIt  will  be  seen  that  this  sub-section  requires  the\n\nprosecution,  if  it  wishes  to  put  the  confession  in\n\nevidence, to prove that it was freely and voluntarily made,\n\nand was not unduly influenced.  This means, at the least,\n\nproof that it was not induced by violence, or by threats or\n\npromises made by a person in authority.  R v Barlin 1926 AD\n\n459, 462;  R v Nhleko 1960(4) SA 712(A);  S v Mpetha and\n\nothers (2) 1983(1) SA 576(C).  This rule, which reflects a\n\nlong-standing  principle  of  the  English  law  of  criminal\n\nprocedure  and  evidence,  was  embodied  in  the  Evidence\n\nOrdinance of the Cape Colony in 1830.  The rationale of the\n\nrule excluding involuntary confessions (or admissions) has\n\nbeen  much  discussed.  See  Hoffmann  and  Zeffertt,  South\n\n\f4\n\nAfrican Law of Evidence, 4th ed. pp 205, 216-7 ;  Cross on\n\nEvidence, 6th ed pp 601-3.   I shall return in due course to\n\nthe historical development of the rule.  At this stage it\n\nis  sufficient  to  say  that  before  the  Union  of  the  four\n\nprovinces in 1910 it was well established in all parts of\n\nSouth Africa that it was for the prosecution to prove that\n\nany confession on which it wished to rely was freely and\n\nvoluntarily made.\n\n[4] Proviso  (a),  on  the  other  hand,  has  no  counterpart  in\n\nEnglish law.  It was introduced into South African law by\n\nthe Criminal Procedure and Evidence Act, 1917.  Its general\n\neffect is that confessions made to members of the police\n\nforce who are not justices of the peace are inadmissible.\n\nAn accused person who has confessed, or expressed a wish to\n\nconfess, to a police officer who is not a justice of the\n\npeace  should  be  taken  to  a  magistrate  or  justice  of  the\n\npeace who may take down the confession in writing.  Even\n\nwhere  the  police  officer  is  a  justice  of  the  peace  the\n\naccused person may be taken to a magistrate who may take\n\ndown the confession in writing.  The magistrate ought, of\n\ncourse, to be satisfied that the confession is freely and\n\nvoluntarily  made,  and  should  record  that  fact  in  the\n\ndocument containing the confession.  It is at that stage\n\nthat proviso (b) to section 217(1) becomes relevant.  That\n\n\f5\n\nproviso reads -\n\n     \"Provided-\n\n     ...\n\n\"(b)\n\nthat where the confession is made to a magistrate and reduced to\nwriting  by  him,  or  is  confirmed  and  reduced  to  writing  in  the\npresence  of  a  magistrate,  the  confession  shall,  upon  the  mere\nproduction thereof at the proceedings in question-\n\n(i)\n\nbe admissible in evidence against such person if it appears\nfrom the document in which the confession is contained that\nthe confession was made by a person whose name corresponds\nto  that  of  such  person  and,  in  the  case  of  a  confession\nmade  to  a  magistrate  or  confirmed  in  the  presence  of  a\nmagistrate through an interpreter, if a certificate by the\ninterpreter appears on such document to the effect that he\ninterpreted  truly  and  correctly  and  to  the  best  of  his\nability with regard to the contents of the confession and\nany question put to such person by the magistrate;  and\n\n(ii)\n\nbe presumed, unless the contrary is proved, to have been\nfreely and voluntarily made by such person in his sound and\nsober  senses  and  without  having  been  unduly  influenced\nthereto,  if  it  appears  from  the  document  in  which  the\nconfession is contained that the confession was made freely\nand  voluntarily  by  such  person  in  his  sound  and  sober\nsenses and without having been unduly influenced thereto.\n\nIt  is  sub-paragraph  (ii)  of  this  proviso  that  is  under\n\nattack  in  the  present  case.    It  was  introduced  into  the\n\ncriminal procedure code in 1977.  In the circumstances set\n\nout  in  the  sub-paragraph  it  places  on  the  accused  the\n\nburden  of  proving  that  the  confession  recorded  by  the\n\nmagistrate was not free and voluntary.  The words \"unless\n\nthe contrary is proved\" place an onus on the accused which\n\nmust be discharged on a balance of probabilities. He does\n\nnot discharge the onus merely by raising a doubt.  If, at\n\nthe  end  of  the  voir  dire  (or  trial-within-a-trial)  the\n\nprobabilities are evenly balanced the presumption prevails.\n\nSee Ex parte Minister of Justice:  in re R v Bolon 1941 AD\n\n345, 360-1;  S v Nene and Others (2) 1979(2) SA 521(D);  S\n\n\f6\n\nv Mkanzi and Another 1979(2) SA 757(T);  S v Mphahlele and\n\nAnother 1982(4) SA 505(A) 512.\n\n[5] I  add,  by  way  of  completeness,  that  sub-section  (2)  of\n\nsection 217 provides that the prosecution may lead evidence\n\nin rebuttal of evidence advanced by an accused in rebuttal\n\nof the presumption under proviso (b).\n\n[6] In the case before us the prosecution tendered confessions\n\nwhich  had  been  made  by  two  of  the  accused  before  a\n\nmagistrate  and  reduced  to  writing,  and  invoked  the\n\npresumption in proviso (b).  \n\n[7]\n\nThe accused were indicted on two counts of murder and one\n\nof  robbery.    At  their  trial  before  Hugo  J  and  assessors\n\nthey  pleaded  not  guilty.    Two  of  the  accused  had  made\n\nstatements before a magistrate which counsel for the state\n\ntendered  as  admissible  confessions.  Admissibility  was\n\ncontested by counsel for the accused and a trial-within-a-\n\ntrial ensued.  At the outset  defence counsel raised the\n\nissue of the constitutionality of section 217(1)(b)(ii) of\n\nthe  Criminal  Procedure  Act,  and  counsel  for  both  the\n\ndefence and the prosecution consented (in terms of section\n\n101(6) of the Constitution) to the trial judge's deciding\n\nthat  issue.    The  trial-within-a-trial  nonetheless\n\n\f7\n\nproceeded.  The accused testified that they had made their\n\nstatements by reason of assaults on them by the police and\n\nthe threat of further assaults.  The policemen concerned\n\ndenied  this,  but  two  women  called  as  witnesses  by  the\n\ndefence said that they had seen the police assaulting the\n\naccused.  At the end of the evidence the court concluded\n\nunanimously  that  while  they  were  not  satisfied  beyond  a\n\nreasonable doubt that the statements had been freely and\n\nvoluntarily made, the accused had failed to discharge the\n\nonus  upon  them  under  proviso  (b)  on  a  balance  of\n\nprobabilities.  In his judgment, given on 10th August, 1994\n\nand reported as S v Zuma and Others 1995(1) BCLR 49 (N),\n\nHugo J said -\n\n\"Had  we  been  convinced  that  section  217(1)(b)  of  the\nCriminal Procedure Act was still valid and constitutional\nwe would therefore have had little hesitation in accepting\nthat the accused had not discharged the  onus placed upon\nthem by that section.  The constitutionality therefore of\nsection  217(1)(b)  of  the  Criminal  Procedure  Act  is\ntherefore crucial to the decision of this case.\"\n\nLater in his judgment he said -\n\n\"It is quite clear from what I have said that the site of\nthe onus will be decisive in this case, at least in so far\nas the admissibility of this evidence is concerned.  If it\nis  held  by  the  constitutional  court  that  section\n217(1)(b)(ii) is unconstitutional it will lead to the most\nunfortunate  result  that  two  persons  who  have  in  effect\nadmitted  under  oath  in  this  Court  that  they  indeed\ncommitted these offences may be acquitted but that may well\nbe the effect of the constitution or the provisions of the\nconstitution upon matters of this nature.  It is also the\neffect  of  the  hearing  of  matters  of  this  nature  in  a\nseparate trial-within-a-trial, the evidence of which is not\nadmissible in deciding the merits of the conviction.\"  \n\n\f8\n\nThe  reference  to  the  admissions  of  the  two  accused  that\n\nthey  had  committed  the  offences  arose  from  the  evidence\n\nwhich they had given in the course of the trial-within-a-\n\ntrial.    As  Hugo  J  fully  appreciated,  that  evidence  was\n\ngiven  only  in  the  context  of  the  trial-within-a-trial,\n\nwhere the only issue was admissibility.  To that issue the\n\ntruth  of  the  confession  was  irrelevant.    Thus,  in  S  v\n\nRadebe and Another, 1968(4) SA 410(A) 419 Ogilvie Thompson\n\nJ A said-\n\n\"It not infrequently occurs that, although the presiding\nJudge may think that the contents of a tendered confession\nare true, the circumstances whereunder the confession was\nmade compel its exclusion\".\n\nSee  also  S  v  Gaba  1985(4)  SA  734(A)  749;    S  v  Talane\n\n1986(3) SA 196(A) 205; S v de Vries 1989(1) SA 228(A), 233-\n\n4.\n\n[8] In  the  event,  notwithstanding  the  consent  given  by  the\n\nparties under section 101(6) Hugo J refrained from giving\n\na decision on the validity of the proviso, but referred the\n\nquestion to this court, and adjourned the trial sine die.\n\n[9] The question of the competence of Hugo J's referral arises,\n\nand has been argued before us by counsel for the accused\n\nand for the State.  In addition we have received a Notice\n\nof Motion under the hand of Mr. T P McNally SC, Attorney-\n\nGeneral for Natal, seeking direct access to the Court in\n\n\f9\n\nterms of section 100(2) of the Constitution on the grounds\n\nthat  it  is  in  the  interests  of  justice  that  a  binding\n\ndecision be given as soon as possible on the validity of\n\nsection 217(1)(b)(ii).\n\n[10] By  reason  of  the  consent  of  the  parties  under  section\n\n101(6)  the  issue  of  the  constitutionality    of  section\n\n217(1)(b)(ii)  of  the  Criminal  Procedure  Act  no  longer\n\nremained within the exclusive jurisdiction of this Court,\n\nand fell within the jurisdiction of Hugo J.  For reasons\n\nwhich  will  be  given  in  detail  in  the  Mhlungu  case  the\n\nreferral by Hugo J was wholly incompetent.  That was indeed\n\nthe submission of the State in its written argument, and\n\nthe point was rightly conceded by counsel for the accused.\n\nEven if a rapid resort to this Court were convenient that\n\nwould not relieve the judge from making his own decision on\n\na  constitutional  issue  within  his  jurisdiction.    The\n\njurisdiction  conferred  on  judges  of  the  Provincial  and\n\nLocal Divisions of the Supreme Court under section 101(3)\n\nis  not  an  optional  jurisdiction.    The  jurisdiction  was\n\nconferred  in  order  to  be  exercised.  It  was  in  these\n\ncircumstances  that  the  Attorney-General  of  Natal  applied\n\nunder section 100(2) of the Constitution for direct access\n\nto the Court.  Section 100(2) reads -\n\n\"(2)\n\nThe  rules  of  the  Constitutional  Court  may  make\nprovision for direct access to the Court where it is\nin the interest of justice to do so in respect of any\n\n\f10\n\nmatter over which it has jurisdiction.\"\n\nRule 17, subrules (1) and (2) of the Rules of this Court\nprovide-\n\n  \n\n(1) \n\nThe  Court  shall  allow  direct  access  in  terms  of  section\n100(2)  of  the  Constitution  in  exceptional  circumstances\nonly, which will ordinarily exist only where the matter is\nof such urgency, or otherwise of such public importance,\nthat  the  delay  necessitated  by  the  use  of  the  ordinary\nprocedures would prejudice the public interest or prejudice\nthe ends of justice and good government.\n\n(2)\n\nThe  special  procedure  referred  to  in  subrule  (1)  may  be\nsanctioned by the Court on application made to it in terms\nof these rules.\n\n[11] The  Attorney-General  of  Natal  submits  in  his  supporting\n\naffidavit  that  if  the  matter  is  sent  back  to  the  trial\n\ncourt without our deciding the issue it would have to be\n\nreferred again to this Court at the end of the trial.  More\n\nimportant, he informs us that prevailing uncertainty as to\n\nthe constitutionality of section 217(1)(b)(ii) has resulted\n\nin inconsistency in practice in Natal and elsewhere in the\n\nRepublic.  That uncertainty would remain unresolved until\n\na suitable case came properly before this Court.  We agree\n\nwith the Attorney-General of Natal and with Mr d'Oliviera\n\nSC, the Attorney-General of the Transvaal, who appeared for\n\nthe  State  that  this  state  of  affairs  must  seriously\n\nprejudice the general administration of justice as well as\n\nthe  interests  of  the  numerous  accused  persons  affected.\n\nThe admissibility of confessions is a question which arises\n\ndaily  in  our  criminal  courts  and  prolonged  uncertainty\n\nwould be quite unacceptable.  As appears from the terms of\n\n\f11\n\nRule  17,  direct  access  is  contemplated  in  only  the  most\n\nexceptional cases, and it is certainly not intended to be\n\nused to legitimate an incompetent reference.  But in the\n\nspecial  circumstances  set  out  in  the  affidavit  the\n\napplication  under  rule  17  was  fully  justified.    Mr.\n\nMcNally's application is accordingly granted, so that the\n\nquestion  of  the  validity  of  section  217(1)(b)(ii)  is\n\nproperly before this Court.\n\n[12] Counsel for the accused has attacked section 217(1)(b)(ii)\n\nas being in conflict with section 25 of the Constitution.\n\nThe  particular  provisions  of  section  25    relied  on\n\nindividually or cumulatively are the following -\n\n\"25 (2)\n\nEvery person arrested for the alleged commission of\nan offence shall ... have the right -\n\n(a)\nshe \n\npromptly to be informed, in a language which he or\nunderstands, that he or she has the right to\nremain  silent  and  to  be  warned  of  the\nconsequences of making any statement;\n\n...\n\n(c)\n\n...\n\n    \n\nnot to be compelled to make a confession or admission\nwhich could be used in evidence against him or her ;\nand\n\n    (3)\n\nEvery accused person shall have the right to a fair trial,\nwhich shall include the right -\n\n...\n\n(c)\n\n(d)\n\nto be presumed innocent and to remain silent during\nplea proceedings or trial and not to testify during\ntrial ;\n\nto  adduce  and  challenge  evidence,  and  not  to  be  a\ncompellable witness against himself or herself;\n\nThe concepts embodied in these provisions are by no means\n\n\f12\n\nan  entirely  new  departure  in  South  African  criminal\n\nprocedure.    The  presumption  of  innocence,  the  right  of\n\nsilence and the proscription of compelled confessions have\n\nfor 150 years or more been recognised as basic principles\n\nof  our  law,  although  all  of  them  have  to  a  greater  or\n\nlesser degree been eroded by statute and in some cases by\n\njudicial decision.  The resulting body of common law and\n\nstatute  law  forms  part  of  the  background  to  section  25.\n\nThe provisions of section 25 are more specific than many of\n\nthe  other  provisions  of  Chapter  3.    They  do  nonetheless\n\ngive rise to problems of interpretation.\n\n[13] The  principles  upon  which  a  constitutional  bill  of\n\nfundamental  rights  should  be  interpreted  have  been  the\n\nsubject of numerous judicial dicta, in jurisdictions abroad\n\nand in Southern Africa.  Many of these principles have been\n\nre-stated and applied in the judgments of Provincial and\n\nLocal Divisions interpreting our own Constitution, and in\n\njudgments of other Southern African courts.  The judgment\n\nof Friedman J in  Nyamakazi v President of Bophututswana,\n\n1994(1)  BCLR  92(B)  is  a  veritable  thesaurus  of\n\ninternational authority.  Khala v The Minister of Safety &\n\nSecurity 1994(2) BCLR 89(W), 92-4; 1994 (4) SA 218(W), 222-\n\n4  per  Myburgh  J  also  contains  a  useful  collection  of\n\ncitations.    It  is  not  necessary  to  traverse  all  the\n\n\frelevant dicta but some of them bear repeating.\n\n13\n\n[14] The  first  of  these  is  the  much-quoted  passage  from  the\n\njudgment  of  Lord  Wilberforce  in  the  Privy  Council  in\n\nMinister of Home Affairs (Bermuda) v Fisher [1980] AC 319\n\n(PC), 328-9.  After referring to the influence of certain\n\ninternational  conventions  on  the  constitutions  of  former\n\ncolonies of the British Commonwealth, he said that these\n\ncalled for\n\n\"a  generous  interpretation  ...  suitable  to  give  to\nindividuals the full measure of the fundamental rights and\nfreedoms referred to,\"\n\nand  that  the  constitution  called  for  \"principles  of\n\ninterpretation of its own\".  He went on to say -\n\n\"This is in no way to say that there are no rules of law\nwhich should apply to the interpretation of a constitution.\nA constitution is a legal instrument giving rise, amongst\nother things, to individual rights capable of enforcement\nin a court of law.  Respect must be paid to the language\nwhich has been used and to the traditions and the usages\nwhich  have  given  meaning  to  that  language.    It  is  quite\nconsistent with this, and with the recognition that rules\nof  interpretation  may  apply,  to  take  as  a  point  of\ndeparture for the process of interpretation a recognition\nof the character and origin of the instrument, and to be\nguided  by  the  principle  of  giving  full  recognition  and\neffect  to  those  fundamental  rights  and  freedoms  with  a\nstatement of which the constitution commences.\"\n\nThis  judgment  was  cited  with  approval  by  the  Appellate\n\nDivision in S v Marwane 1982(3) SA 717(A), 748-9.  See also\n\nthe  judgment  of  the  Full  Bench  of  the  Supreme  Court  of\n\nNamibia  in  Minister  of  Defence,  Namibia  v  Mwandinghi\n\n1992(2) SA 355 (Nm SC), 362.  \n\n\f14\n\n[15] In R v Big M Drug Mart Ltd  (1985)18  DLR  (4th) 321,395-6,\n\nDickson  J  (later  Chief  Justice  of  Canada)  said,  with\n\nreference to the Canadian Charter of Rights -\n\n\"The  meaning  of  a  right  or  freedom  guaranteed  by  the\nCharter was to be ascertained by an analysis of the purpose\nof such a guarantee ;  it was to be understood, in other\nwords,  in  the  light  of  the  interests  it  was  meant  to\nprotect.  In my view this analysis is to be undertaken, and\nthe purpose of the right or freedom in question is to be\nsought by reference to the character and larger objects of\nthe Charter itself, to the language chosen to articulate\nthe specific right or freedom, to the historical origins of\nthe concept enshrined, and where applicable, to the meaning\nand purpose of the other specific rights and freedoms with\nwhich it is associated within the text of the Charter.  The\ninterpretation  should  be  ....  a  generous  rather  than\nlegalistic  one,  aimed  at  fulfilling  the  purpose  of  a\nguarantee and the securing for individuals the full benefit\nof the Charter's protection.\"\n\nBoth Lord Wilberforce and Dickson J emphasised that regard\n\nmust be paid to the legal history, traditions and usages of\n\nthe country concerned, if the purposes of its constitution\n\nare  be  fully  understood.    This  must  be  right.    I  may\n\nnonetheless be permitted to refer to what I said in another\n\ncourt  of  another  constitution  albeit  in  a  dissenting\n\njudgment -\n\n\"Constitutional rights conferred without express limitation\nshould  not  be  cut  down  by  reading  implicit  restrictions\ninto them, so as to bring them into line with the common\nlaw.\n\nAttorney-General v Moagi 1982(2) Botswana LR 124,184\n\n[16] That  caveat  is  of  particular  importance  in  interpreting\n\nsection  25(3)  of  the  Constitution.  The  right  to  a  fair\n\ntrial conferred by that  provision is broader than the list\n\nof specific rights set out in paragraphs (a) to (j) of the\n\n\f15\n\nsub-section.  It embraces a concept of substantive fairness\n\nwhich  is  not  to  be  equated  with  what  might  have  passed\n\nmuster in our criminal courts before the Constitution came\n\ninto force. In S v Rudman and Another; S v Mthwana 1992(1)\n\nSA 343(A), the Appellate Division, while not decrying the\n\nimportance of fairness in criminal proceedings, held that\n\nthe function of a court of criminal appeal in South Africa\n\nwas to enquire\n\n\"whether  there  has  been  an  irregularity  or    illegality,\nthat  is  a  departure  from  the  formalities,  rules  and\nprinciples of procedure according to which our law requires\na criminal trial to be initiated or conducted\".\n\nA court of appeal, it was said, (at 377)\n\n    \n\n\"does not enquire whether the trial was fair in accordance\nwith 'notions of basic fairness and justice', or with the\n'ideas  underlying  the  concept  of  justice  which  are  the\nbasis \ncriminal\nadministration'.\"\n\ncivilised \n\nsystems \n\nall \n\nof \n\nof \n\nThat was an authoritative statement of the law before 27th\n\nApril  1994.  Since  that  date  section  25(3)  has  required\n\ncriminal  trials  to  be  conducted  in  accordance  with  just\n\nthose \"notions of basic fairness and justice\".  It is now\n\nfor all courts hearing criminal trials or criminal appeals\n\nto give content to those  notions.\n\n[17] I must also refer to Qozoleni v Minister of Law and Order\n\n1994(1)  BCLR  75(E);  1994(3)  SA  625(E).    The  judgment  of\n\nFroneman  J.  contains  much  of  value  in  its  approach  to\n\nconstitutional interpretation.  The learned judge says (at\n\n\f16\n\n81) that the previous constitutional system of this country\n\nwas the fundamental \"mischief\" to be remedied by the new\n\nConstitution.    He  says  (at  80)  that  because  the\n\nConstitution is the supreme law against which all law is to\n\nbe tested,\n\n\"it  must  be  examined  with  a  view  to  extracting  from  it\nthose principles or values against which such law ... can\nbe measured.\"\n\nHe  adds  on  the  same  page  that  the  Constitution  must  be\n\ninterpreted so as \"to give clear expression to the values\n\nit seeks to nurture for a future South Africa.\"  This is\n\nundoubtedly true.  South African Courts are indeed enjoined\n\nby section 35 of the Constitution to interpret Chapter 3 so\n\nas    \"to  promote  the  values  which  underlie  an  open  and\n\ndemocratic  society  based  on  freedom  and  equality\",  and,\n\nwhere  applicable,  to  have  regard  to  relevant  public\n\ninternational law.  That section also permits our courts to\n\nhave regard to comparable foreign case law.\n\nI am, however, sure that Froneman J, in his reference to\n\nthe fundamental \"mischief\" to be remedied, did not intend\n\nto say that all the principles of law which have hitherto\n\ngoverned our courts are to be ignored.  Those principles\n\nobviously contain much of lasting value.  Nor, I am equally\n\nsure,  did  the  learned  judge  intend  to  suggest  that  we\n\nshould neglect the language of the Constitution.  While we\n\nmust  always  be  conscious  of  the  values  underlying  the\n\nConstitution,  it  is  nonetheless  our  task  to  interpret  a\n\n\f17\n\nwritten instrument.   I am well aware of the fallacy of\n\nsupposing  that  general  language  must  have  a  single\n\n\"objective\" meaning.  Nor is it easy to avoid the influence\n\nof  one's  personal  intellectual  and  moral  preconceptions.\n\nBut  it  cannot  be  too  strongly  stressed  that  the\n\nConstitution  does  not  mean  whatever  we  might  wish  it  to\n\nmean.  \n\n[18] We  must  heed  Lord  Wilberforce's  reminder  that  even  a\n\nconstitution is a legal instrument, the language of which\n\nmust be respected.  If the language used by the lawgiver is\n\nignored  in  favour  of  a  general  resort  to  \"values\"  the\n\nresult  is  not  interpretation  but  divination.    If  I  may\n\nagain quote S v Moagi, supra, at 184, I would say that a\n\nconstitution\n\n\"embodying fundamental rights should as far as its language\n\npermits be given a broad construction\"\n\n(My emphasis),\n\n[19] As pointed out above, section 217(1)(b)(ii) creates a legal\n\npresumption,  with  the  legal  burden  of  rebuttal  on  the\n\naccused  -  what  has  been  called  a  \"reverse  onus\".    The\n\nlegitimacy of such provisions has been considered by courts\n\nas varied as the United States Supreme Court, The Canadian\n\nSupreme Court, the Privy Council and the European Court of\n\nHuman  Rights  (and  doubtless  others)  in  the  light  of\n\n\f18\n\nprovisions  entrenching,  in  varying  language,  the\n\npresumption  of  innocence,  the  right  to  silence  and  the\n\nprivilege  against  self-incrimination  -  a  privilege  not\n\nexpressly  referred  to  in  section  25.      The  case  law  of\n\nthese  courts  -  which  are  undoubtedly  courts  of  open  and\n\ndemocratic  societies  -  indicates  that  reverse  onus\n\nprovisions are by no means uncommon and are not necessarily\n\nunconstitutional.    Reverse  onus  provisions  in  our  own\n\nstatute law are also not uncommon.  To go no further than\n\nthe  Criminal  Procedure  Act  one  finds,  for  example,  the\n\npresumptions arising from entries in marriage registers on\n\ncharges  of  bigamy  (section  237),  the  presumption  of\n\nknowledge  of  falsity  arising  from  proof  of  a  factually\n\nfalse representation (section 245) and the presumption of\n\nhaving failed to pay tax arising merely from an allegation\n\nin  a  charge  sheet  (section  249).    Foreign  courts  have\n\ngrappled  with  the  problem  of  reconciling  presumptions\n\nreversing  the  onus  of  proof  with  the  constitutional\n\npresumption of innocence.  The different solutions which\n\nthey have suggested are illuminating.\n\n[20] The  courts  of  the  United  States  have  over  many  years\n\nattempted to enunciate a governing principle.  Tot v The\n\nUnited States 319 US 463 (1943) concerned a federal statute\n\nmaking it an offence for a person convicted of violence to\n\n\f19\n\nreceive any firearm or ammunition which had been shipped or\n\ntransported  in  interstate  or  foreign  commerce.      The\n\nstatute  provided  that  \"the  possession  of  a  firearm  or\n\nammunition by any such person shall be presumptive evidence\n\nthat such firearm or ammunition was shipped transported or\n\nreceived  as  the  case  may  be,  by  such  person  ...  in\n\nviolation of this Act\".   The Supreme Court held that while\n\nCongress  and  state  legislatures  had  \"power  to  prescribe\n\nwhat evidence is to be received in the courts of the United\n\nStates\", the due process clauses of the Constitution \n\n\"set  limits  upon  the  power  of  Congress  or  that  of  a  state\nlegislature  to  make  the  proof  of  one  fact  or  group  of  facts\nevidence of the existence of the ultimate fact on which guilt is\npredicated.\" (per Roberts J at 467)\n\nThe test of the validity of such a presumption, the Court\n\nsaid, was that there be a \n\n\"rational  connection  between  the  facts  proved  and  the  fact\npresumed ... .  But where the inference is so strained as not to\nhave  a  reasonable  relation  to  the  circumstances  of  life  as  we\nknow them it is not competent for the legislature to create it as\na rule governing the procedure of the courts.  (467-8)\n\nOn this test the presumption was struck down.  Twenty-five\n\nyears later a somewhat stricter test was formulated.  In\n\nLeary v United States 395 US 6(1969) the Supreme Court had\n\nto consider a statute under which possession of marihuana\n\nwas  deemed  to  be  sufficient  evidence  of  the  offence  of\n\nillegal  importation,  unless  the  defendant  explained  his\n\npossession  to  the  satisfaction  of  the  jury.      The\n\npresumption was held to be a denial of due process of law.\n\n\f20\n\nHaving  considered  Tot  and  some  later  cases,  Harlan  J,\n\nspeaking for the Court, said that\n\n\"a  criminal  statutory  presumption  must  be  regarded  as\n'irrational' or 'arbitrary' and hence unconstitutional, unless it\ncan at least be said with substantial assurance that the presumed\nfact  is  more  likely  than  not  to  flow  from  the  proved  fact  on\nwhich it is made to depend.\" (page 36)\n\n(Harlan  J  added  the  rider  that  in  this  assessment  the\n\nCongressional determination favouring the presumption must\n\nweigh heavily.)\n\n[21] \"Rational connection\" is a useful screening test, but not\n\na conclusive one.   This was acknowledged in County Court\n\nof Ulster County, New York, et al v Allen et al 442 US 140\n\n(1979).    In  relation  to  a  mandatory  (i.e.  legal)\n\npresumption Stevens J giving judgment for the majority of\n\nthe Supreme Court, said, at 167, that\n\n\"since  the  prosecution  bears  the  burden  of  establishing\nguilt, it may not rest its case entirely on a presumption\nunless  the  fact  proved  is  sufficient  to  support  the\ninference of guilt beyond a reasonable doubt.\" \n\nThe \"rational connection\" test has been considered in the\n\nsubstantial  jurisprudence  which  the  Canadian  courts  have\n\ndeveloped  in  construing  their  Charter  of  Rights.    The\n\nCanadian cases on reverse onus provisions seem to me to be\n\nparticularly helpful, not only because of their persuasive\n\nreasoning,  but  because  section  1  of  the  Charter  has  a\n\nlimitation  clause  analogous  to  section  33  of  the  South\n\nAfrican  Constitution.    This  calls  for  a  \"two-stage\"\n\napproach.    First,  has  there  been  a  contravention  of  a\n\n\f21\n\nguaranteed  right?    If  so,  is  it  justified  under  the\n\nlimitation clause?   The single stage approach (as in the\n\nUS Constitution or the Hong Kong Bill of Rights) may call\n\nfor  a  more  flexible  approach  to  the  construction  of  the\n\nfundamental right, whereas the two-stage approach may call\n\nfor  a  broader  interpretation  of  the  fundamental  right,\n\nqualified only at the second stage.   In Attorney-General\n\nof Hong Kong v Lee Kwong-kut, [1993] AC 951 (PC), an appeal\n\nto  the  Privy  Council  from  Hong  Kong,  Lord  Woolf,  while\n\nnoting that the results of the two approaches often tend to\n\nbe  similar,  observed  (at  967  H)  that  the  two-stage\n\napproach, \n\nin \n\nlaying \n\ndown \n\nspecific \n\ncriteria \n\nof\n\njustification, had important practical consequences.  See\n\nalso  Cachalia  &  others,  Fundamental  Rights  in  the  New\n\nConstitution, pp5-7.\n\n[22] There  are  numerous  Canadian  cases  dealing  with  the\n\nconstitutionality  of  reverse  onus  provisions.    I  shall\n\nrefer only to three of them.  In R v Oakes (1986) 26 DLR\n\n(4th) 200 the Supreme Court of Canada had before it an Act\n\nof Parliament which provided that if a person was proved to\n\nbe in unlawful possession of a narcotic he was presumed to\n\nbe in possession of it for the purposes of trafficking (a\n\nmore serious offence) unless he proved the contrary.   This\n\nproof,  the  Court  held,  had  to  be  on  a  balance  of\n\n\f22\n\nprobabilities.    This  presumption  was  held  to  be\n\ninconsistent with the presumption of innocence guaranteed\n\nby  section  11(d)  of  the  Canadian  Charter  of  Rights  and\n\nFreedoms.  Dickson CJC said at 212-3 -\n\n\"The  presumption  of  innocence  protects  the  fundamental\nliberty and human dignity of any and every person accused\nby the State of criminal conduct.  An individual charged\nwith  a  criminal  offence  faces  grave  social  and  personal\nconsequences, including potential loss of physical liberty,\nsubjection  to  social  stigma  and  ostracism  from  the\ncommunity,  as  well  as  other  social,  psychological  and\neconomic  harms.    In  light  of  the  gravity  of  these\nconsequences, the presumption of innocence is crucial.  It\nensures  that  until  the  State  proves  an  accused's  guilt\nbeyond all reasonable doubt, he or she is innocent.  This\nis essential in a society committed to fairness and social\njustice.\"\n\nAnd, at 222,\n\n\"If an accused bears the burden of disproving on a balance\nof  probabilities  an  essential  element  of  an  offence,  it\nwould  be  possible  for  a  conviction  to  occur  despite  the\nexistence of a reasonable doubt.  This would arise if the\naccused adduced sufficient evidence to raise a reasonable\ndoubt as to his or her innocence but did not convince the\njury on a balance of probabilities that the presumed fact\nwas untrue.\"\n\nHe held further that the \"rational connection\" test, while\n\npossibly  useful  at  the  stage  when  the  State  sought  to\n\njustify an infringement of a guaranteed right in terms of\n\nsection  1  of  the  Charter,  was  not  in  itself  an  adequate\n\nprotection for the constitutional presumption of innocence.\n\n\"A basic fact may rationally tend to prove a presumed fact,\nbut not prove its existence beyond a reasonable doubt.  An\naccused  person  could  thereby  be  convicted  despite  the\npresence  of  a  reasonable  doubt.    This  would  violate  the\npresumption of innocence.\"\n\n[23] R  v  Whyte  (1988)  51  DLR  (4th)  481  concerned  a  statute\n\ncreating the offence of having care or control of a motor\n\n\f23\n\nvehicle  while  one's  ability  to  drive  was  impaired  by\n\nalcohol.  Under the statute, upon proof that the accused\n\noccupied the driver's seat he was deemed to have the care\n\nand control of the vehicle unless he established that he\n\ndid not enter the vehicle for the purpose of setting it in\n\nmotion.  This presumption, too, was held to be a violation\n\nof the right to the presumption of innocence.  The Supreme\n\nCourt, again speaking through Dickson CJC, held that it was\n\nirrelevant  that  the  presumption  did  not  relate  to  an\n\n\"essential element\" in the offence (cf R v Oakes, supra at\n\n222).  The Chief Justice, at 493, said -\n\n\"In the case at bar, the Attorney-General of Canada argued\nthat since the intention to set the vehicle in motion is\nnot  an  element  of  the  offence,  s.  237(1)(a)  does  not\ninfringe the presumption of innocence.  Counsel relied on\nthe passage from Oakes quoted above, with its reference to\nan  \"essential  element\",  to  support  this  argument.    The\naccused here is required to disprove a fact collateral to\nthe substantive offence, unlike Oakes where the accused was\nrequired to disprove an element of the offence.\n\nThe short answer to this argument is that the distinction between\nelements  of  the  offence  and  other  aspects  of  the  charge  is\nirrelevant  to  the  s.  11(d)  inquiry.    The  real  concern  is  not\nwhether the accused must disprove an element or prove an excuse,\nbut  that  an  accused  may  be  convicted  while  a  reasonable  doubt\nexists.  When that possibility exists, there is a breach of the\npresumption of innocence.\n\nThe  exact  characterization  of  a  factor  as  an  essential\nelement,  a  collateral  factor,  an  excuse,  or  a  defence\nshould  not  affect  the  analysis  of  the  presumption  of\ninnocence.  It is the final effect of a provision on the\nverdict  that  is  decisive.    If  an  accused  is  required  to\nprove some fact on the balance of probabilities to avoid\nconviction,  the  provision  violates  the  presumption  of\ninnocence  because  it  permits  a  conviction  in  spite  of  a\nreasonable doubt in the mind of the trier of fact as to the\nguilt of the accused.\"\n\n[24] In 1992, in R v Downey 90 DLR (4th) 449, the Supreme Court\n\n\f24\n\nof Canada dealt with a statutory presumption that a person\n\nwho  lives  with  or  is  habitually  in  the  company  of\n\nprostitutes,  is,  in  the  absence  of  evidence  to  the\n\ncontrary, committing the offence of \"living on the avails\n\n[i.e. proceeds] of another person's prostitution\".   This\n\npresumption was also held to infringe the presumption of\n\ninnocence (although it was held by a majority to be in all\n\nthe  circumstances  a  justifiable  infringement.)    The\n\njudgment  of  Cory  J  at  456  contains  a  useful  analysis  of\n\ndifferent types of presumption.   The type with which we\n\nare concerned in section 217(1)(b)(ii) is described as a\n\nlegal  presumption  \"where  the  presumed  fact  must  be\n\ndisproved on a balance of probabilities instead of by the\n\nmere raising of evidence to the contrary\".   This is what\n\nthe Canadian courts refer to as a \"reverse onus\" clause, as\n\nI do in this judgment.\n\n[25] Cory J at 461 summarised the principles derived from the\n\nauthorities in seven propositions.  I shall quote the first\n\nthree-\n\n\"I.\n\nII.\n\nIII.\n\nThe  presumption  of  innocence  is  infringed  whenever\nthe  accused  is  liable  to  be  convicted  despite  the\nexistence of a reasonable doubt.\nIf by the provisions of a statutory presumption, an\naccused is required to establish, that is to say to\nprove  or  disprove,  on  a  balance  of  probabilities\neither an element of an offence or an excuse, then it\ncontravenes s. 11(d).  Such a provision would permit\na conviction in spite of a reasonable doubt.\nEven  if  a  rational  connection  exists  between  the\nestablished fact and the fact to be presumed, this\nwould  be  insufficient  to  make  valid  a  presumption\nrequiring the accused to disprove an element of the\n\n\f25\n\noffence.\"\n\nSection  11(d)  of  the  Canadian  Charter  provides  that  any\n\nperson charged with an offence has the right\n\n\"(d)\n\nto be presumed innocent until proven guilty according\nto law in a fair and public hearing by an independent\nand impartial tribunal\".\n\nThis bears a close relationship to section 25(3)(a) and (c)\n\nof our Constitution.  In both Canada and South Africa the\n\npresumption of innocence is derived from the centuries-old\n\nprinciple of English law, forcefully restated by Viscount\n\nSankey in his celebrated speech in Woolmington v Director\n\nof Public Prosecutions [1935] AC 462 (HL), 481, that it is\n\nalways  for  the  prosecution  to  prove  the  guilt  of  the\n\naccused person, and that the proof must be proof beyond a\n\nreasonable  doubt.    Accordingly,  I  consider  that  we  may\n\nappropriately  apply  the  principles  worked  out  by  the\n\nCanadian  Supreme  Court  in  particular  the  first  two\n\nprinciples stated by Cory J, supra.\n\n[26] Does  the  application  of  these  principles  in  itself\n\ndemonstrate a violation of the presumption of innocence in\n\nsection  217(1)(b)(ii)?      Mr  d'Oliviera  for  the  State\n\ncontended that it did not.  The admission of a confession,\n\nhe said, did not conclude the prosecution in favour of the\n\nState.    Thus  in  the  present  case  further  evidence  might\n\nentitle the trial court in this case to review its finding\n\n\f26\n\nthat  the  accused  had  not  discharged  the  onus  on  them.\n\nThere might also be evidence which would lead a court to\n\nfind that a confession, although admissible, was untrue.\n\nMoreover, the presumption did not relate to any element of\n\nthe offence charged, but merely to the voluntary character\n\nof the confession.  This was no more than a question of\n\nadmissibility of evidence.\n\n[27] These arguments were persuasively presented, but in my view\n\nthey cannot be accepted.  A confession by definition is an\n\nadmission  of  all  the  elements  of  the  offence  charged,  a\n\nfull acknowledgment of guilt.  R v Becker 1929 AD 167.  No\n\ndoubt in some cases additional evidence (for example, that\n\nthe  confession  is  false)  will  lead  to  an  acquittal\n\nnotwithstanding the admission of the confession.  But the\n\nvalidity of the presumption is not to be tested on a case\n\nby  case  basis.    In  the  absence  of  other  evidence  the\n\npresumption, unrebutted, stands throughout the trial.  It\n\ncould  therefore  happen  that,  given  proof  aliunde  of  the\n\ncrime itself (section 209 of the Criminal Procedure Act),\n\na conviction could follow from an admissible confession,\n\nnotwithstanding the court's reasonable doubt that it was\n\nfreely and voluntarily made.  The practical effect of the\n\npresumption is that the accused may be required to prove a\n\nfact  on  the  balance  of    probabilities  in  order  to  avoid\n\n\f27\n\nconviction.    Cf.  R  v  Whyte,  supra,  loc.  cit.  (last\n\nparagraph).\n\n[28] In the course of argument I asked Mr d'Oliviera whether, if\n\nthere  were  no  further  evidence,  the  trial  court  in  this\n\ncase could properly give expression to its doubts as to the\n\nvoluntariness of the confession by acquitting the accused.\n\nMr  d'Oliviera  submitted  that  it  could  do  so  -  as  I\n\nunderstood  him,  by  the  judge's  exercising  a  judicial\n\ndiscretion  to  reject  admissible  but  unfairly  prejudicial\n\nevidence.      The  authority  for  the  existence  of  such  a\n\ndiscretion  is  conflicting.  See  R  v  Roets  and  Another\n\n1954(3) SA 512(A), 520; S v Mkanzi and Another 1979(2) SA\n\n757(T);  S  v  Mphahlele  supra.      Even  if  there  is  such  a\n\ndiscretion  and  even  if  it  could  be  exercised  so  as  to\n\novercome  a  statutory  presumption  (surely  a  doubtful\n\nproposition)1 that gives rise to no more than a possibility\n\nof an acquittal; the possibility of a conviction remains.\n\nThe presumption of innocence cannot depend on the exercise\n\nof discretion.\n\n[29] The suggestion that the common law rule placing the onus of\n\n     In England there appears to be a judicial discretion to exclude an admissible confession, for example\nbecause the methods used to obtain it, while not unlawful, were unfair.  R v Sang [1980] A.C. 402 (HL), 437.\n\n\f28\n\nproving voluntariness on the prosecution is merely a rule\n\nof  evidence  and  can  therefore  be  freely  altered  by  the\n\nlegislature deserves and requires fuller consideration. In\n\npart  it  is  answered  by  the  quotation  from  Tot  v  United\n\nStates of America, supra.   In Tregea and Another v Godart\n\nand Another  1939  AD  16,  32  Stratford  CJ  said  that  if  a\n\nrebuttable presumption of law shifts the burden of proof it\n\nis not a mere rule of evidence but a matter of substantive\n\nlaw.    But  even  if  the  common  law  rule  governing  the\n\nadmissibility of confessions is a rule of evidence, it is,\n\nas  I  shall  show,  a  rule  which  lies  at  the  heart  of\n\nimportant  rights  embodied  in  section  25,  including  the\n\nright  to  remain  silent  after  arrest,  the  right  not  be\n\ncompelled  to  make  a  confession  which  can  be  used  in\n\nevidence, the right to be presumed innocent and the right\n\nnot to be a compellable witness against oneself.\n\n[30] The rule itself derives from more than 300 years of English\n\nlegal history.  By the latter half of the 18th century the\n\nrule was clearly stated in its modern form-\n\n\"A confession forced from the mind by the flattery of hope\nor by the torture of fear comes in so questionable a shape,\nwhen it is to be considered as evidence of guilt, that no\ncredit ought to be given to it\" -\n\n               R v Warwickshall (1783) 1 Leach, 263.\n\nIn Ibrahim v R [1914] AC 599 (PC) at 610 Lord Sumner said\n\nthat this was a rule of policy. It would appear that the\n\n\f29\n\nrule  derived  from  a  determination  to  eradicate  the\n\noppressive  and  often  barbaric  methods  of  interrogation\n\nemployed  by  the  Star  Chamber  in  17th  century  England  to\n\nextract  confessions  from  accused  persons.    From  the\n\nabhorrence of those methods there developed the privilege\n\nagainst self-incrimination, and the right of silence, one\n\naspect of which is the exclusion of compelled confessions,\n\nwith  the  onus  placed  on  the  prosecution  to  prove  beyond\n\nreasonable  doubt  that  any  confession  relied  on    was\n\nvoluntary.  In  Smith  v  Director  of  Serious  Fraud  Office\n\n[1993] AC 1 (HL) Lord Mustill distinguished the \"disparate\n\ngroup of immunities\" denoted by the expression \"the right\n\nto  silence\".    At  32  Lord  Mustill  observed  that  the  law\n\nrelating to proof of the voluntariness of confessions was\n\nparticularly important at a time when an accused was not\n\nentitled to give evidence on his own behalf - a disability\n\nremoved in England only in 1898.  Nonetheless, Lord Mustill\n\nsaid, \n\n\"Even now, nearly hundred years after that disability has\nbeen removed, the imprint of the old law is still clearly\nto be seen.\"\n\nIt is indeed.\n\n[31] In Lam Chi-Ming v R, [1991] 2 AC 212 (PC), 220, an appeal\nto the Privy Council from Hong Kong, Lord Griffiths said-\n\n\"Their  lordships  are  of  the  view  that  the  more  recent\nEnglish  cases  established  that  the  rejection  of  an\nimproperly obtained confession is not dependent only upon\npossible unreliability but also upon the principle that a\nman cannot be compelled to incriminate himself and upon the\n\n\f30\n\nimportance that attaches in a civilised society to proper\nbehaviour by the police towards those in their custody. All\nthree of these factors have combined to produce the rule of\nlaw applicable in Hong Kong as well as in England that a\nconfession  is  not  admissible  in  evidence  unless  the\nprosecution establish that it was voluntary. This, perhaps\nthe most fundamental rule of the English criminal law, now\nfinds expression in England in section 76 of the Police and\nCriminal Evidence Act 1984.\"\n\nIn Wong Kam-ming v R [1980] AC 247 (PC), 261, Lord Hailsham\n\nstated the underlying principle in memorable words-\n\n\"any civilised system of criminal jurisprudence must accord\nto  the  judiciary  some  means  of  excluding  confessions  or\nadmissions obtained by improper methods. This is not only\nbecause of the potential unreliability of such statements,\nbut  also,  and  perhaps    mainly,  because  in  a  civilised\nsociety it is vital that persons in custody or charged with\noffences  should  not  be  subjected  to  ill  treatment  or\nimproper pressure in order to extract confessions. It is\ntherefore of very great importance that the courts should\ncontinue  to  insist  that  before  extra-judicial  statements\ncan be admitted  in evidence the prosecution must be made\nto prove beyond reasonable doubt that the statement was not\nobtained  in  a  manner  which  should  be  reprobated  and  was\ntherefore in the truest sense voluntary.\"\n\nIn South Africa, too, courts have over the years recognised\n\nthe origins and the importance of the common law rule. In\n\nR v Camane and Others 1925 AD 570, 575 Innes CJ said-\n\n\"Now, it is an  established principle of our law that no\none  can  be  compelled  to  give  evidence  incriminating\nhimself.  He cannot be forced to do that either before the\ntrial,  or  during  the  trial.    The  principle  comes  to  us\nthrough  the  English  law,  and  its  roots  go  far  back  in\nhistory.  Wigmore, in his book on  Evidence (vol IV, sec.\n2250) traces very accurately the genesis, and indicates the\nlimits  of  the  privilege.  And  he  shows  that,  however\nimportant the doctrine may be, it is necessary to confine\nit  within  its  proper  limits.    What  the  rule  forbids  is\ncompelling  a  man  to  give  evidence  which  incriminates\nhimself.\"\n\n[32] In R v Gumede and Another 1942 AD 398, 412-4, Feetham JA\n\nreferred  to  the  embodiment  of  the  rule  in  the  Criminal\n\nProcedure and Evidence Act 1917, and  noted that its first\n\n\f31\n\nappearance in South Africa was in Ordinance No 72 of 1830\n\nof the Cape of Good Hope. There was no doubt, he said, that\n\nthe Ordinance was intended to apply to the Cape Colony the\n\ncommon law of England in regard to the  burden of proof\n\nresting on the prosecution when asking a criminal court to\n\nadmit a confession alleged to have been made by an accused\n\nperson. He cited the cases of R v Warwickshall, supra and\n\nIbrahim v R, supra,  as did Nicholas AJA, in his detailed\n\nexamination of the rule in S v de Vries, supra, 232-4.\n\n[33] The conclusion which I reach, as a result of this survey,\n\nis  that  the  common  law  rule  in  regard  to  the  burden  of\n\nproving  that  a  confession  was  voluntary  has  been  not  a\n\nfortuitous but an integral and essential part of the right\n\nto  remain  silent  after  arrest,  the  right  not  to  be\n\ncompelled to make a confession, and the right not to be a\n\ncompellable  witness  against  oneself.    These  rights,  in\n\nturn, are the necessary reinforcement of Viscount Sankey's\n\n\"golden thread\" - that it is for the prosecution to prove\n\nthe  guilt  of  the  accused  beyond  reasonable  doubt\n\n(Woolmington's case, supra).  Reverse the burden of proof\n\nand  all  these  rights  are  seriously  compromised  and\n\nundermined.  I therefore consider that the common law rule\n\non  the  burden  of  proof  is  inherent  in  the  rights\n\nspecifically mentioned in section 25(2) and (3)(c) and (d),\n\n\f32\n\nand  forms  part  of  the  right  to  a  fair  trial.      In  so\n\ninterpreting these provisions of the Constitution I have\n\ntaken account of the historical background, and comparable\n\nforeign case law.  I believe too that this interpretation\n\npromotes the values which underlie an open and democratic\n\nsociety  and  is  entirely  consistent  with  the  language  of\n\nsection 25.  It follows that section 217(1)(b)(ii) violates\n\nthese provisions of the Constitution.\n\n[34] I should add that I prefer not to consider in this judgment\n\nthe meaning and scope of the right to silence during trial.\n\nIt is unnecessary to decide whether section 217(1)(b)(ii)\n\nviolates that right.\n\n[35] The  State  submitted,  in  the  alternative,  that  if  the\n\nproviso in question is a violation of fundamental rights,\n\nit  is  one  which  is  saved  by  section  33(1)  of  the\n\nConstitution.    The  proviso,  it  was  argued,  was  a  law  of\n\ngeneral  application  which  was  (i)  reasonable,  (ii)\n\njustifiable  in  an  open  and  democratic  society  based  on\n\nfreedom  and  equality,  under  paragraph  (a)  of  the  sub-\n\nsection and was also \"necessary\" in terms of paragraph (b).\n\nMuch written and oral argument was addressed to us on the\n\nCanadian approach to the broadly  analogous provision in\n\nsection  1  of  the  Canadian  Charter,  which  guarantees  the\n\n\f33\n\nrights and freedoms set out in that document\n\n\"subject only to such reasonable limits prescribed by law\nas can be demonstrably justified in a free and democratic\nsociety\".\n\nThe  Canadian  courts  have  evolved  certain  criteria,  in\n\napplying this section, such as the existence of substantial\n\nand  pressing  public  needs  which  are  met  by  the  impugned\n\nstatute.  There,  if  the  statutory  violation  is  to  be\n\njustified it must also pass a \"proportionality\" test, which\n\nthe courts dissect into several components.   See, e.g. R\n\nv Chaulk (1991) 1 CRR (2d) 1.   These criteria may well be\n\nof  assistance  to  our  courts  in  cases  where  a  delicate\n\nbalancing of individual rights against social interests is\n\nrequired.   But section 33(1) itself sets out the criteria\n\nwhich we are to apply, and I see no reason, in this case at\n\nleast,  to  attempt  to  fit  our  analysis  into  the  Canadian\n\npattern.\n\n[36] As  to  reasonableness  I  am  prepared  to  assume  that  the\n\npresumption passes the \"rational connection\" test, although\n\nI am not convinced of this.  But that does not in itself\n\nexplain why it should be thought reasonable to undermine a\n\nlong-established and now entrenched right.  The tests of\n\nreasonableness,  justifiability  and  necessity  are  not\n\nidentical, and in applying each of them individually one\n\nwill  not  always  get  the  same  result.    But  in  this\n\n\f34\n\nparticular  instance  reasonableness,  justification  and\n\nnecessity  may  be  looked  at  and  assessed  together.    The\n\nState's problems here are manifold.  The rights interfered\n\nwith  are  fundamental  to  our  concepts  of  justice  and\n\nforensic fairness.  They have existed in this country for\n\nover 150 years.  A drastic consequence of the alteration to\n\nthe  law  brought  about  by  section  217(1)(b)(ii)  is  the\n\npossibility  that  an  accused  may  be  convicted  over  the\n\nreasonable doubt of the court.  Nor has it been shown that\n\nit is in practice impossible or unduly burdensome for the\n\nState to discharge its onus; it has done so successfully in\n\ninnumerable  trials  under  the  common  law  rule.    The\n\ncircumstances in which an accused person agreed to make a\n\nconfession  are  not  peculiarly  within  his  or  her  own\n\nknowledge.  What then is the rationale of the proviso?  The\n\nanswer, it seems (and we have been given no other) lies in\n\nthe Report of the Botha Commission into criminal procedure\n\nand evidence (RP 78/1971).   The extract I quote here is\n\ntaken from the written submissions on behalf of the accused\n\nin this case.\n\n\"5.31.3.  It  is  however  a  disquieting  phenomenon  that\naccused  persons,  after  having  made  a  confession  to  a\nmagistrate which was confirmed and reduced to writing in\nthe presence of a magistrate or justice, far too frequently\nand sometimes under the influence of others and in spite of\ntheir contrary allegations to the magistrate or justice,\nallege  at  their  trial  that  the  confession  was  in  fact\nimproperly obtained from them and is therefore inadmissible\nin  evidence  with  the  result  that,  notwithstanding  the\naccused's erstwhile allegations, the admissibility thereof\nhas, far too frequently, to be determined at an extended\nhearing where the onus rests upon the State throughout.  As\na judicial officer a magistrate is peculiarly equipped and\n\n\f35\n\nable,  with  the  aid  of  his  personal  observation  and\npreceding  interrogation  of  the  person  who  makes  the\nconfession, to come to a prima facie conclusion in regard\nto the question whether the confession was or is being made\nfreely  and  voluntarily  by  such  person  in  his  sound  and\nsober senses without having been unduly influenced thereto,\nand it is highly improbable that a magistrate would take a\nconfession  from  someone  unless  he  is  convinced  of  the\nexistence  of  the  prescribed  requirements  for  the\nadmissibility thereof.  In view of these considerations,\nand  to  give  meaning  to  the  making  or  confirmation  of  a\nconfession  to  or  in  the  presence  of  a  magistrate,  the\nCommission is of the opinion that, where a confession was\nmade to a magistrate and reduced to writing, or confirmed\nand reduced to writing in the presence of a magistrate, it\nshould at the trial of that person for an offence to which\nthe  confession  relates,  be  presumed,  unless  that  person\nproved  the  contrary  (that  is  to  say,  on  a  balance  of\nprobabilities)  that  the  confession  was  made  freely  and\nvoluntarily by such person in his sound and sober senses\nwithout  having  been  unduly  influenced  thereto.    The\nCommission therefore recommends that a further proviso to\nthis effect be added to section 244(1) with reference to a\nconfession made to a magistrate or confirmed and reduced to\nwriting in the presence of a magistrate.  Such a provision\nwould considerably shorten and may eliminate the extent of\nthe so called trials within a trial.\"\n\nIt appears from this passage that the harm which the new\n\nproviso was intended to overcome was twofold.  First, some\n\naccused  attempt  dishonestly  to  retract  confessions  which\n\nthey have made before a magistrate.  Second, this leads to\n\nunduly long trials within trials.  The justification of the\n\namendment,  therefore,  was  that  it  would  make  it  more\n\ndifficult  for  the  dishonest  accused  to  make  false\n\nallegations of duress, and that this would shorten trials.\n\n[37] As  to  the  first  head  of  justification,  the  objective  is\n\nlaudable.    But  the  reasoning  of  the  Commission  seems  to\n\noverlook the interests of an accused who has in fact been\n\nsubject to duress.  The Commission itself, in para 5.23 of\n\nits  Report,  recognised  that  an  apparently  voluntary\n\n\f36\n\nconfirmation of a confession before a magistrate \"may be\n\nmisleading,  where  the  confession  was  in  fact  forced\n\nbeforehand by improper interrogation or inducement by the\n\npolice.\"  There is nothing before this Court to show that\n\nthe  common  law  rule  caused  substantial  harm  to  the\n\nadministration of justice.  The Commission points to the\n\nimprobability of a magistrate taking a confession unless\n\nconvinced  of  its  voluntariness.      That  may  well  be  an\n\nimprobability in most cases, but why that should justify\n\nplacing a burden of proof on the accused I am unable to\n\nfollow.  That improbability has always weighed  against an\n\naccused and will continue to do so, without resort to the\n\nproviso.    In  any  event  there  is  nothing  in  the  Criminal\n\nProcedure  Act  which  obliges  a  magistrate  to  conduct  any\n\nparticular  preliminary  enquiry  into  voluntariness.    Some\n\nAttorneys-General  and  magistrates  have  drafted  helpful\n\nquestionnaires for the use of magistrates or justices of\n\nthe peace before recording a confession.  But there is no\n\nstandard form and none with statutory provenance.\n\n[38] The reverse onus may in some cases obviate or shorten the\n\ntrial within a trial.  Those of my colleagues on the Court\n\nwho have had  considerable experience of criminal trials\n\ndoubt that is so.  Even if it were the case, and even if it\n\ndid release police or prosecution from the inconvenience of\n\n\f37\n\nmarshalling and calling their witnesses before the accused\n\ngave  evidence,  I  cannot  regard  those  inconveniences  as\n\noutweighing and justifying the substantial infringement of\n\nthe important rights which I have identified.  The argument\n\nfrom convenience would only have merit in situations where\n\naccused  persons  plainly  have  more  convenient  access  to\n\nproof, and where the reversed burden does not create undue\n\nhardship or unfairness.   Cf R v Oakes (1983) 3 CRR  289,\n\n304, per Martin JA in the Ontario Court of Appeal.  That is\n\nnot the case here.\n\n[39] Accordingly, section 217(b)(ii) does not meet the criteria\n\nlaid  down  in  section  33(1)  of  the  Constitution.    It  is\n\ninconsistent with the Constitution and in terms of section\n\n98(5) of the Constitution, it must be declared invalid.\n\n[40] It follows that in my opinion the ruling given by Levinsohn\n\nJ in S v Shangase and Another 1994(2) BCLR 42(D); 1995(1)\n\nSA 425(D) was correct. \n\n[41] It is important, I believe, to emphasise what this judgment\n\ndoes  not  decide.    It  does  not  decide  that  all  statutory\n\nprovisions which create presumptions in criminal cases are\n\ninvalid.  This Court recognises the pressing social need\n\nfor the effective prosecution of crime, and that in some\n\n\f38\n\ncases the prosecution may require reasonable presumptions\n\nto assist it in this task.  Presumptions are of different\n\ntypes.    Some  are  no  more  than  evidential  presumptions,\n\nwhich give certain prosecution evidence the status of prima\n\nfacie  proof,  requiring  the  accused  to  do  no  more  than\n\nproduce credible evidence which casts doubt on the  prima\n\nfacie proof.  See e.g. the presumptions in section 212 of\n\nthe Criminal Procedure Act.  This judgment does not relate\n\nto  such  presumptions.      Nor  does  it  seek  to  invalidate\n\nevery legal presumption reversing the onus of proof.  Some\n\nmay  be  justifiable  as  being  rational  in  themselves,\n\nrequiring an accused person to prove only facts to which he\n\nor she has easy access, and which it would be unreasonable\n\nto expect the prosecution to disprove.   The provisions in\n\nsection 237 of the Act (evidence on charge of bigamy) may\n\nbe of this type.  Or there may be presumptions which are\n\nnecessary  if  certain  offences  are  to  be  effectively\n\nprosecuted,  and  the  State  is  able  to  show  that  for  good\n\nreason  it  cannot  be  expected  to  produce  the  evidence\n\nitself.    The  presumption  that  a  person  who  habitually\n\nconsorts  with  prostitutes  is  living  off  the  proceeds  of\n\nprostitution was upheld on that basis in R v Downey supra\n\nby the Supreme Court of Canada.  A similar presumption in\n\na United Kingdom statute was upheld by the European Court\n\nof  Human  Rights  in  X  v  United  Kingdom  (Application  No\n\n\f39\n\n5124/71, Collection of Decisions, ECHR 135).  This is not\n\nsuch a case.  Nor does this judgment deal with statutory\n\nprovisions  which  are  in  form  presumptions  but  which  in\n\neffect  create  new  offences.      See  Attorney-General  v\n\nOdendaal 1982 Botswana LR 194, 226-7.\n\n[42] I would also make clear that this judgment does not purport\n\nto apply to exceptions, exemptions or provisos to statutory\n\noffences,  referred  to  in  section  90  of  the  Criminal\n\nProcedure Act and in the extensive case law on that section\n\nand its predecessors.  Nor, of course, does it deal with\n\nthe factors governing the creation of offences of strict\n\nliability,  discussed  in  Amalgamated  Beverage  Industries\n\nNatal (Pty) Ltd v Durban City Council 1994(3) SA 170 and\n\n646(A), although the considerations weighed in that case\n\nmay not be irrelevant to the constitutional validity of \n\ncertain statutory presumptions. \n\n[43] It is necessary, finally, to consider what order, if any,\n\nshould  be  made  under  section  98(6)  of  the  Constitution\n\nconsequent upon the finding of invalidity.  The terms of\n\nthat sub-section are as follows -\n\n\"(6) Unless the Constitutional Court in the interests of\njustice and good government orders otherwise, and save to\nthe extent that it so orders, the declaration of invalidity\nof a law or a provision thereof -\n\n\f(a)\n\n(b)\n\n40\n\nexisting  at  the  commencement  of  this\nConstitution,  shall  not  invalidate  anything\ndone or permitted in terms thereof before the\ncoming  into  effect  of  such  declaration  of\ninvalidity ;or\n\nafter \n\npassed \nshall\ninvalidate  everything  done  or  permitted  in\nterms thereof.\n\ncommencement, \n\nsuch \n\nParagraph  (a)  of  the  sub-section  applies  in  this  case.\n\nAbsent a specific order by this Court, any decision by a\n\ntrial court admitting a confession in reliance on section\n\n217(1)(b)(ii), given before the date of the declaration of\n\nits invalidity, would stand.  This would be unfortunate for\n\nsome  accused  persons.    But  if  we  were  to  give  our\n\ndeclaration full retrospective effect in terms of section\n\n98(6)  so  as  to  invalidate  such  earlier  rulings  on\n\nadmissibility  the  likely  result  of  such  order  would  be\n\nnumerous  appeals  with  the  possibility  of  proceedings  de\n\nnovo under sections 313 or 324 of the Criminal Procedure\n\nAct.  In  proceedings  de  novo  the  necessary  evidence  of\n\nvoluntariness may no longer be available.  Paragraph (a) of\n\nsection 98(6) is intended to ensure that the invalidation\n\nof a statute existing at the date of commencement of the\n\nConstitution should not ordinarily have any retrospective\n\neffect, so as to avoid the dislocation and inconvenience of\n\nundoing transactions, decisions or actions taken under that\n\nstatute.    This  Court's  power  to  order  otherwise  in  the\n\ninterests  of  justice  and  good  government  should  be\n\nexercised circumspectly.  In some cases (and I believe that\n\n\f41\n\nthis is one of them) the interests of individuals must be\n\nweighed against the interest of avoiding dislocation to the\n\nadministration of justice and the desirability of a smooth\n\ntransition  from  the  old  to  the  new.  We  should  also  take\n\ninto  account  the  fact  that  hitherto  the  police  and\n\nprosecution \n\nhave \n\nlegitimately \n\nrelied \n\non \n\nsection\n\n217(1)(b)(ii).    Cf.  the  approach  of  the  United  States\n\nSupreme Court in such cases as Linkletter v Walker 381 US\n\n618 (1965) and Stovall v Denno 388 US 293 (1967). \n\n[44] The application of section 217(1)(b)(ii) since 27th April,\n\n1994 may well have caused injustice to accused persons, but\n\nwe cannot repair all past injustice by a simple stroke of\n\nthe pen.  Weighing all the relevant considerations it seems\n\nto me that the proper balance can be struck by invalidating\n\nthe  admission  of  any  confession  in  reliance  on  section\n\n217(1)(b)(ii) before the date of our declaration, but in\n\nrespect only of trials begun on or after 27th April, 1994,\n\nand not completed at the date of delivery of this judgment.\n\nThe  effect  might  be  in  those  trials  to  require\n\nreconsideration of the admissibility of confessions already\n\nadmitted,  including  the  hearing  of  further  evidence. \n\nWhether  an  order  under  section  98(6)  may  or  should\n\nencompass proceedings which were pending before 27th April,\n\n1994,  depends  on  the  proper  interpretation  of  section\n\n\f42\n\n241(8) of the Constitution.  As indicated at the beginning\n\nof the judgment, that issue is deferred for determination\n\nin the Mhlungu case.   \n\n[45] In the present case the trial judge has given no decision\n\non the admissibility of the confessions, so that no special\n\norder need be made in respect of it.\n\n[46] In conclusion, we should like to express our indebtedness\n\nto Mr A Findlay S.C. and his colleagues, of the Durban Bar,\n\nwho appeared for the accused persons at the request of the\n\nCourt.\n\nThe following order is accordingly made :-\n\n1\n\n2\n\nIt is declared that section 217(1)(b)(ii) of the\nCriminal Procedure Act, 1977, is invalid.\n\nIn terms of sub-section (6) of section 98 of the\nConstitution it is ordered that this declaration\nshall  invalidate  any  application  of  the  said\nsection 217(1)(b)(ii) in any criminal trial which\ncommenced  on  or  after  27th  April,  1994,  and  in\nwhich  the  verdict  has  not  at  the  date  of  this\norder been given. \n\n______________________________\nS.KENTRIDGE\nACTING JUDGE OF THE CONSTITUTIONAL COURT\n\nWe concur in the judgement of Kentridge AJ:\n\n     \n\nChaskalson P\n\n\f  \n\nAckermann J\n\nDidcott J\n\nKriegler J\n     \n  \nLanga J\n\nMadala J\n\nMahomed J\n\nMokgoro J\n\nO'Regan J\n\nSachs J\n\nCASE NO\n\n43\n\n:\n\nCCT/5/94 \n\nCOUNSEL FOR APPLICANT \n:    A. Findlay SC\n                              MJD Wallis SC\n                              PJ Olsen\n                              M. Mkize\n                              K Govender\n\nINSTRUCTED BY\n\n:    \n\nCOUNSEL FOR RESPONDENT\n                              JWS de Villiers\n                              I  Stretch\n\n:    JA van S d'Oliveira SC\n\n\f                              EA Erasmus\n                              SM Galloway \n\n44\n\nINSTRUCTED BY\n\nDATE OF HEARING\n\n:\n\n:\n\n23 February 1995\n\nDATE OF JUDGMENT\n\n:\n\n5 April 1995\n\n\f"}}]}